---
title: تكوين اكتشاف الجهاز
description: تعرف على كيفية تكوين اكتشاف الجهاز في Microsoft 365 Defender باستخدام الاكتشاف الأساسي أو القياسي
keywords: أساسي، قياسي، تكوين اكتشاف نقطة النهاية، اكتشاف الجهاز
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
f1.keywords:
- NOCSH
ms.author: macapara
author: mjcaparas
ms.localizationpriority: medium
manager: dansimp
audience: ITPro
ms.collection:
- M365-security-compliance
- m365initiative-m365-defender
ms.custom: admindeeplinkDEFENDER
ms.topic: conceptual
ms.technology: m365d
ms.openlocfilehash: 77dbdb290a0f8643bd24e1a3c561b823e5c2e4b3
ms.sourcegitcommit: bdd6ffc6ebe4e6cb212ab22793d9513dae6d798c
ms.translationtype: MT
ms.contentlocale: ar-SA
ms.lasthandoff: 03/08/2022
ms.locfileid: "63574262"
---
# <a name="configure-device-discovery"></a>تكوين اكتشاف الجهاز

[!INCLUDE [Microsoft 365 Defender rebranding](../../includes/microsoft-defender.md)]

**ينطبق على:**

- [خطة Microsoft Defender لنقطة النهاية 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)
- [Microsoft 365 Defender](https://go.microsoft.com/fwlink/?linkid=2118804)


يمكن تكوين الاكتشاف لتكون في الوضع القياسي أو الأساسي. استخدم الخيار القياسي للعثور بنشاط على الأجهزة في شبكتك، مما يضمن اكتشاف نقاط النهاية بشكل أفضل وتوفير تصنيف أفضل للأجهزة.

يمكنك تخصيص قائمة الأجهزة المستخدمة لتنفيذ الاكتشاف القياسي. يمكنك إما تمكين الاكتشاف القياسي على جميع الأجهزة المجهزة التي تدعم هذه الإمكانية أيضا (حاليا - Windows 10 أو أي وقت لاحق و Windows Server 2019 أو الأجهزة اللاحقة فقط) أو تحديد مجموعة فرعية أو مجموعات فرعية من أجهزتك عن طريق تحديد علامات أجهزتها.

## <a name="set-up-device-discovery"></a>إعداد اكتشاف الجهاز

لإعداد اكتشاف الجهاز، قم باتباع خطوات التكوين التالية في Microsoft 365 Defender<a href="https://go.microsoft.com/fwlink/p/?linkid=2077139" target="_blank">:</a>

الانتقال إلى **الإعدادات** >  **الكشف**

1. إذا كنت تريد تكوين Basic ك وضع الاكتشاف لاستخدامه على الأجهزة المجهزة، فحدد **أساسي** ثم حدد **حفظ**
2. إذا قمت بتحديد استخدام الاكتشاف القياسي، فحدد الأجهزة التي يجب استخدامها للكشف النشط: كل الأجهزة أو مجموعة فرعية من خلال تحديد علامات الأجهزة الخاصة بها، ثم حدد **حفظ**

> [!NOTE]
>يستخدم الاكتشاف القياسي برامج PowerShell النصية المختلفة لكشف الأجهزة بشكل نشط في الشبكة. يتم توقيع برامج PowerShell النصية هذه من Microsoft وتنفيذها من الموقع التالي: `C:\ProgramData\Microsoft\Windows Defender Advanced Threat Protection\Downloads\*.ps`. على سبيل المثال، `C:\ProgramData\Microsoft\Windows Defender Advanced Threat Protection\Downloads\UnicastScannerV1.1.0.ps1`.

## <a name="exclude-devices-from-being-actively-probed-in-standard-discovery"></a>استبعاد الأجهزة من أن يتم إدخالها بنشاط في الاكتشاف القياسي

إذا كانت هناك أجهزة على شبكتك يجب ألا يتم فحصها بشكل نشط (على سبيل المثال، الأجهزة المستخدمة كمحلات عسل لأداة أمان أخرى)، يمكنك أيضا تحديد قائمة استثناءات لمنع فحصها ضوئيا. تجدر الإشارة إلى أنه لا يزال من الممكن اكتشاف الأجهزة باستخدام وضع الاكتشاف الأساسي، كما يمكن اكتشافها من خلال محاولات اكتشاف البث المتعدد. سيتم اكتشاف هذه الأجهزة بشكل سلبي ولكن لن يتم اكتشافها بشكل نشط.

يمكنك تكوين الأجهزة التي تريد استبعادها في صفحة **الاستثناءات** .

## <a name="select-networks-to-monitor"></a>تحديد الشبكات لمراقبتها

يقوم Microsoft Defender for Endpoint بتحليل شبكة ويحدد ما إذا كانت شبكة شركة يجب مراقبتها أو شبكة غير خاصة بالشركة يمكن تجاهلها. لتحديد شبكة باعتبارها شركة، نقوم بربط معرفات الشبكة عبر جميع عملاء المستأجر وإذا كانت معظم الأجهزة في المؤسسة قد أوصلتها بنفس اسم الشبكة، بنفس البوابة الافتراضية وعنوان خادم DHCP، فإننا نفترض أن هذه شبكة شركة. يتم عادة اختيار شبكات الشركات لكي تتم مراقبتها. ومع ذلك، يمكنك تجاوز هذا القرار باختيار مراقبة الشبكات غير الخاصة بالشركة حيث يتم العثور على الأجهزة المجهزة.

يمكنك تكوين مكان تنفيذ اكتشاف الجهاز من خلال تحديد الشبكات التي يجب مراقبتها. عند مراقبة شبكة، يمكن إجراء اكتشاف الجهاز عليها.

تظهر قائمة بالشبكات التي يمكن فيها إجراء اكتشاف الجهاز في صفحة **الشبكات** المراقبة.

> [!NOTE]
> تعرض القائمة الشبكات التي تم تعريفها كالشبكات الخاصة بالشركة. إذا تم تعريف أقل من 50 شبكة كالشبكات الخاصة بالشركة، فظهرت عندئذ قائمة تصل إلى 50 شبكة تتضمن أكثر الأجهزة المجهزة.

يتم فرز قائمة الشبكات المراقبة استنادا إلى العدد الإجمالي للأجهزة التي تم عرضها على الشبكة في آخر 7 أيام.

يمكنك تطبيق عامل تصفية لعرض أي من الحالات التالية لاكتشاف الشبكة:

- **الشبكات المراقبة** - الشبكات التي يتم فيها تنفيذ اكتشاف الجهاز.
- **الشبكات التي تم تجاهلها** - سيتم تجاهل هذه الشبكة ولن يتم تنفيذ اكتشاف الجهاز عليها.
- **الكل** - سيتم عرض كل من الشبكات التي تم مراقبتها وتجاهلها.

### <a name="configure-the-network-monitor-state"></a>تكوين حالة جهاز عرض الشبكة

يمكنك التحكم في مكان اكتشاف الجهاز. الشبكات المراقبة هي المكان الذي سيتم فيه تنفيذ اكتشاف الجهاز وعادة ما تكون شبكات شركات. يمكنك أيضا اختيار تجاهل الشبكات أو تحديد تصنيف الاكتشاف الأولي بعد تعديل حالة.

يعني اختيار تصنيف الاكتشاف الأولي تطبيق حالة مراقبة الشبكة الافتراضية التي تم إعدادها من قبل النظام. يعني تحديد حالة مراقبة الشبكة الافتراضية التي تم إعدادها من قبل النظام أنه سيتم مراقبة الشبكات التي تم تحديدها على أنها شركة، كما سيتم تجاهل الشبكات التي تم تعريفها على أنها غير خاصة بالشركة بشكل تلقائي.

1. حدد **الإعدادات > اكتشاف الجهاز**.
2. حدد **الشبكات المراقبة**.
3. عرض قائمة الشبكات.
4. حدد النقاط الثلاث المجاورة لاسم الشبكة.
5. اختر ما إذا كنت تريد مراقبة تصنيف الاكتشاف الأولي أو تجاهله أو استخدامه.

    > [!WARNING]
    >
    > - قد يؤدي اختيار مراقبة شبكة لم يحددها Microsoft Defender ل Endpoint كالشبكات الخاصة بالشركة إلى اكتشاف الجهاز خارج شبكة الشركة، وبالتالي قد يكشف عن أجهزة منزلية أو أجهزة أخرى غير خاصة بالشركة.
    > - يؤدي اختيار تجاهل شبكة إلى إيقاف مراقبة الأجهزة واكتشافها في تلك الشبكة. لن تتم إزالة الأجهزة التي تم اكتشافها بالفعل من المخزون، ولكن لن يتم تحديثها بعد الآن، كما سيتم الاحتفاظ بالتفاصيل حتى تنتهي صلاحية فترة استبقاء البيانات في Defender for Endpoint.
    > - قبل اختيار مراقبة الشبكات غير الخاصة بالشركة، يجب أن تضمن أن يكون لديك الإذن للقيام بذلك. <br>

6. تأكد من أنك تريد إجراء التغيير.

## <a name="explore-devices-in-the-network"></a>استكشاف الأجهزة في الشبكة

يمكنك استخدام استعلام البحث المتقدم التالي للحصول على مزيد من السياق حول كل اسم شبكة موضح في قائمة الشبكات. يسرد الاستعلام جميع الأجهزة المضمنة التي كانت متصلة بشبكة معينة خلال آخر 7 أيام.

```kusto
DeviceNetworkInfo
| where Timestamp > ago(7d)
| where ConnectedNetworks  != ""
| extend ConnectedNetworksExp = parse_json(ConnectedNetworks)
| mv-expand bagexpansion = array ConnectedNetworks=ConnectedNetworksExp
| extend NetworkName = tostring(ConnectedNetworks ["Name"]), Description = tostring(ConnectedNetworks ["Description"]), NetworkCategory = tostring(ConnectedNetworks ["Category"])
| where NetworkName == "<your network name here>"
| summarize arg_max(Timestamp, *) by DeviceId
```

## <a name="get-information-on-device"></a>الحصول على معلومات على الجهاز

يمكنك استخدام استعلام البحث المتقدم التالي للحصول على أحدث المعلومات الكاملة على جهاز معين.

```kusto
DeviceInfo
| where DeviceName == "<device name here>" and isnotempty(OSPlatform)
| summarize arg_max(Timestamp, *) by DeviceId
```

## <a name="see-also"></a>راجع أيضًا

- [نظرة عامة على اكتشاف الجهاز](device-discovery.md)
- [الأسئلة المفهمة حول اكتشاف الجهاز](device-discovery-faq.md)
