---
title: نظرة عامة على اكتشاف الجهاز
description: تعرف على كيفية الاستفادة من اكتشاف نقاط النهاية في Microsoft 365 Defender للعثور على الأجهزة غير التي يتم إجادتها في شبكتك
keywords: اكتشاف الأجهزة واكتشافها وسلبها واستباقها والشبكات والرؤية وخادمها ومعملها وألواحها والأجهزة غير المدارة
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
f1.keywords:
- NOCSH
ms.author: siosulli
author: mjcaparas
ms.localizationpriority: medium
manager: dansimp
audience: ITPro
ms.collection:
- M365-security-compliance
- m365initiative-m365-defender
- m365-initiative-defender-endpoint
ms.custom: admindeeplinkDEFENDER
ms.topic: conceptual
ms.technology: m365d
ms.openlocfilehash: 926d23cb4e9abcecd9d34e976dee60851471613b
ms.sourcegitcommit: b0c3ffd7ddee9b30fab85047a71a31483b5c649b
ms.translationtype: MT
ms.contentlocale: ar-SA
ms.lasthandoff: 03/25/2022
ms.locfileid: "64472914"
---
# <a name="device-discovery-overview"></a>نظرة عامة على اكتشاف الجهاز

[!INCLUDE [Microsoft 365 Defender rebranding](../../includes/microsoft-defender.md)]

**ينطبق على:**
- [Microsoft Defender لنقطة النهاية 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)
- [Microsoft 365 Defender](https://go.microsoft.com/fwlink/?linkid=2118804)

تتطلب حماية بيئتك أخذ مخزون الأجهزة في شبكتك. ومع ذلك، قد تكون عملية تعيين الأجهزة في الشبكة غالبا ما تكون مكلفة وصعبة وتستغرق وقتا طويلا.

Microsoft Defender لنقطة النهاية إمكانية اكتشاف الأجهزة التي تساعدك على العثور على الأجهزة غير الإدارة المتصلة بشبكة الشركة دون الحاجة إلى أجهزة إضافية أو تغييرات عملية مرهقة. يستخدم اكتشاف الجهاز نقاط النهاية المجهزة في شبكتك لتجميع الشبكة أو تجميعها أو فحصها ضوئيا لاكتشاف الأجهزة غير التي يتم إدارةها. تسمح لك إمكانية اكتشاف الجهاز باكتشاف:

- نقاط نهاية المؤسسة (محطات العمل، الخوادم والأجهزة المحمولة) غير المجهزة بعد Microsoft Defender لنقطة النهاية
- أجهزة الشبكة مثل الموجهات والمفاتيح
- أجهزة IoT مثل الطابعات والكاميرات

تقدم الأجهزة غير المعروفة وغير المراقبة مخاطر كبيرة على الشبكة - سواء كانت طابعة غير مواضع أو أجهزة شبكة ذات تكوينات أمان ضعيفة أو خادم بدون عناصر تحكم أمان. بمجرد اكتشاف الأجهزة، يمكنك:

- نقاط النهاية غير المراقبة في الخدمة، مما يزيد من مستوى رؤية الأمان عليها.
- قم بخفض مساحة الهجوم من خلال تحديد نقاط الضعف وتقييمها، والكشف عن فجوات التكوين.

شاهد هذا الفيديو للحصول على نظرة عامة سريعة حول كيفية اكتشاف الجهاز:

> [!VIDEO https://www.microsoft.com/en-us/videoplayer/embed/RWORdQ]

بالتزامن مع هذه الإمكانية، تتوفر توصية أمان للأجهزة المجهزة Microsoft Defender لنقطة النهاية كجزء من تجربة إدارة المخاطر والثغرات الأمنية الحالية.

## <a name="discovery-methods"></a>أساليب الاكتشاف

يمكنك اختيار وضع الاكتشاف الذي سيتم استخدامه من قبل الأجهزة المجهزة. يتحكم الوضع في مستوى الرؤية الذي يمكنك الحصول عليه للأجهزة غير الإدارة في شبكة الشركة.

يتوفر وضعان من الاكتشاف:

- **الاكتشاف الأساسي**: في هذا الوضع، ستجمع نقاط النهاية الأحداث في شبكتك بشكل سلبي وتستخرج معلومات الجهاز منها. يستخدم الاكتشاف الأساسي SenseNDR.exe الثنائية الخاصة بجمع بيانات الشبكة السلبية ولن يتم بدء أي حركة مرور للشبكة. ستستخرج نقاط النهاية ببساطة البيانات من كل حركة مرور على الشبكة يتم شاهدتها بواسطة جهاز تم ا متنبها. باستخدام الاكتشاف الأساسي، لن تحصل إلا على رؤية محدودة لنقاط النهاية غير المراقبة في شبكتك.

- **الاكتشاف القياسي** (مستحسن): يتيح هذا الوضع لنقاط النهاية العثور بنشاط على الأجهزة الموجودة في شبكتك لإثراء البيانات المجمعة واكتشاف المزيد من الأجهزة - مما يساعدك على إنشاء مخزون موثوق ومتناسق للأجهزة. بالإضافة إلى الأجهزة التي تم ملاحظتها باستخدام الأسلوب السلبي، فإن الوضع القياسي يستخدم أيضا بروتوكولات الاكتشاف الشائعة التي تستخدم استعلامات البث المتعدد في الشبكة للعثور على المزيد من الأجهزة. يستخدم الوضع القياسي عملية استكشاف ذكية ونشطة لاكتشاف معلومات إضافية حول الأجهزة التي تم ملاحظتها لإثراء معلومات الجهاز الموجودة. عند تمكين الوضع القياسي، قد تكون أدوات مراقبة الشبكة في مؤسستك قد لاحظت الحد الأدنى من نشاط الشبكة الذي تم إنشاؤه بواسطة مستشعر الاكتشاف.

يمكنك تغيير إعدادات الاكتشاف وتخصيصها، لمزيد من المعلومات، راجع [تكوين اكتشاف الجهاز](configure-device-discovery.md).

> [!IMPORTANT]
> الاكتشاف القياسي هو الوضع الافتراضي لجميع العملاء بدءا من 19 يوليو 2021. يمكنك اختيار تغيير هذا التكوين إلى تكوين أساسي من خلال صفحة الإعدادات. إذا اخترت الوضع الأساسي، فسوف تحصل فقط على رؤية محدودة لنقاط النهاية غير التي يتم تشغيلها في شبكتك.

> [!NOTE]
> يميز محرك الاكتشاف بين أحداث الشبكة التي يتم تلقيها في شبكة الشركة مقابل خارج شبكة الشركة. لن يتم اكتشاف الأجهزة غير المتصلة بشبكة الشركة أو إدراجها في مخزون الأجهزة.

## <a name="device-inventory"></a>مخزون الجهاز

سيتم إدراج الأجهزة التي تم اكتشافها ولكن لم يتم بعد تشغيلها وتأمينها بواسطة Microsoft Defender لنقطة النهاية في مخزون الأجهزة ضمن علامة التبويب أجهزة الكمبيوتر والأجهزة المحمولة.

لتقييم هذه الأجهزة، يمكنك استخدام عامل تصفية في قائمة مخزون الأجهزة يسمى حالة الضم، والتي يمكن أن تتضمن أي من القيم التالية:

- تم التكهين: يتم تعيين نقطة النهاية إلى Microsoft Defender لنقطة النهاية.
- يمكن التكهين: تم اكتشاف نقطة النهاية في الشبكة، كما تم تحديد نظام التشغيل على أنه نظام معتمد من قبل Microsoft Defender لنقطة النهاية، ولكنه غير مدعم حاليا. نوصي بشدة بتك الجديدة في هذه الأجهزة.
- غير معتمد: تم اكتشاف نقطة النهاية في الشبكة ولكن لم يتم Microsoft Defender لنقطة النهاية.
- معلومات غير كافية: لا يمكن للنظام تحديد إمكانية دعم الجهاز. يمكن أن يؤدي تمكين الاكتشاف القياسي على المزيد من الأجهزة في الشبكة إلى إثراء السمات التي تم اكتشافها.

:::image type="content" source="images/2b62255cd3a9dd42f3219e437b956fb9.png" alt-text="لوحة معلومات مخزون الجهاز" lightbox="images/2b62255cd3a9dd42f3219e437b956fb9.png":::

> [!TIP]
> يمكنك دائما تطبيق عوامل التصفية لاستبعاد الأجهزة غير التي يتم إدارةها من قائمة مخزون الأجهزة. يمكنك أيضا استخدام عمود حالة الboarding على استعلامات API لتصفية الأجهزة غير التي يتم استخدامها.

لمزيد من المعلومات، راجع [مخزون الجهاز](machines-view-overview.md).

## <a name="network-device-discovery"></a>اكتشاف جهاز الشبكة

وينشئ العدد الكبير من أجهزة الشبكة غير المعالجة التي تم نشرها في مؤسسة مساحة كبيرة للهجوم، ويمثل خطرا كبيرا على المؤسسة بكاملها. Microsoft Defender لنقطة النهاية قدرات اكتشاف الشبكة على ضمان اكتشاف أجهزة الشبكة وتصنيفها بدقة وإضافتها إلى مخزون الأصول.

لا يتم إدارة أجهزة الشبكة كنقاط نهاية قياسية، حيث لا يوجد لدى Defender for Endpoint مستشعر مضمن في أجهزة الشبكة نفسها. تتطلب هذه الأنواع من الأجهزة نهجا بدون وكيل حيث سيحصل الفحص عن بعد على المعلومات الضرورية من الأجهزة. للقيام بذلك، سيتم استخدام Microsoft Defender لنقطة النهاية معين على كل مقطع شبكة لإجراء عمليات فحص دورية مصدق عليها من أجهزة الشبكة التي تم تكوينها مسبقا. بمجرد اكتشافها، توفر قدرات إدارة المخاطر والثغرات الأمنية Defender ل Endpoint مهام سير عمل متكاملة لتأمين مفاتيح التبديل والموجهات ووحدات تحكم WLAN وجدران الحماية وبوابات VPN التي تم اكتشافها.

لمزيد من المعلومات، راجع [أجهزة الشبكة](network-devices.md).

## <a name="device-discovery-integrations"></a>عمليات تكامل اكتشاف الجهاز

لمعالجة التحدي المتمثل في الحصول على رؤية كافية لتحديد موقع مخزون أصول OT/IOT الكامل وتحديده وتأمينه Microsoft Defender لنقطة النهاية يدعم عمليات التكامل التالية:

- **Corelight**: قامت Microsoft ب شراكة مع Corelight لتلقي البيانات من أجهزة شبكة Corelight. يوفر هذا Microsoft 365 Defender رؤية متزايدة لأنشطة الشبكة للأجهزة غير المراقبة، بما في ذلك الاتصال بالأجهزة الأخرى غير المراقبة أو الشبكات الخارجية. لمزيد من المعلومات، راجع [تمكين تكامل بيانات Corelight](corelight-integration.md).

- **Microsoft Defender ل IoT**: يجمع هذا التكامل بين قدرات اكتشاف أجهزة Microsoft Defender لنقطة النهاية، مع إمكانات المراقبة بدون وكيل من Microsoft Defender for IoT، لتأمين أجهزة IoT الخاصة بالمؤسسات المتصلة بشبكة IT (على سبيل المثال، الصوت عبر بروتوكول الإنترنت (VoIP) والطابعات وأجهزة التلفزيون الذكية). لمزيد من المعلومات، راجع [تمكين تكامل Microsoft Defender ل IoT](enable-microsoft-defender-for-iot-integration.md).

## <a name="vulnerability-assessment-on-discovered-devices"></a>تقييم الثغرات على الأجهزة المكتشفة

تشكل نقاط الضعف والمخاطر على أجهزتك والأجهزة الأخرى غير المكتشفة في الشبكة جزءا من تدفقات TVM الحالية ضمن "الأمان التوصيات" والممثلة في صفحات الكيان عبر المدخل.
ابحث عن توصيات الأمان ذات الصلة ب "SSH" للعثور على نقاط الضعف SSH المرتبطة بالأجهزة غير المدارة والمدارة.

:::image type="content" source="images/1156c82ffadd356ce329d1cf551e806c.png" alt-text="لوحة معلومات توصيات الأمان" lightbox="images/1156c82ffadd356ce329d1cf551e806c.png":::


## <a name="use-advanced-hunting-on-discovered-devices"></a>استخدام "البحث المتقدم" على الأجهزة المكتشفة

يمكنك استخدام استعلامات "البحث المتقدم" للحصول على الرؤية على الأجهزة المكتشفة.
يمكنك العثور على تفاصيل حول نقاط النهاية المكتشفة في جدول DeviceInfo، أو المعلومات ذات الصلة بالشبكة حول هذه الأجهزة في جدول DeviceNetworkInfo.

:::image type="content" source="images/f48ba1779eddee9872f167453c24e5c9.png" alt-text="صفحة البحث المتقدم التي يمكن استخدام الاستعلامات عليها" lightbox="images/f48ba1779eddee9872f167453c24e5c9.png":::

يعمل اكتشاف الجهاز Microsoft Defender لنقطة النهاية الأجهزة المجهزة كمصدر بيانات الشبكة لنسب الأنشطة إلى الأجهزة غير المجهزة. وهذا يعني أنه إذا كان جهاز Microsoft Defender لنقطة النهاية تم توصيله بجهاز غير م لوح، يمكن رؤية الأنشطة على الجهاز غير الملوح على المخطط الزمني ومن خلال الجدول DeviceNetworkEvents للصيد المتقدم.

تستند الأحداث الجديدة إلى اتصالات بروتوكول التحكم في الإرسال (TCP) وستتناسب مع نظام DeviceNetworkEvents الحالي. دخول TCP إلى Microsoft Defender لنقطة النهاية تم تمكينه من جهاز غير Microsoft Defender لنقطة النهاية تمكينه.

لقد تم أيضا إضافة أنواع الإجراءات التالية:

- ConnectionAttempt - محاولة لإنشاء اتصال TCP (syn)
- ConnectionAcknowledged - إقرار بقبول اتصال TCP (syn\ack)

يمكنك تجربة استعلام المثال التالي:

```text
DeviceNetworkEvents
| where ActionType == "ConnectionAcknowledged" or ActionType == "ConnectionAttempt"
| take 10
```

## <a name="next-steps"></a>الخطوات التالية

- [تكوين اكتشاف الجهاز](configure-device-discovery.md)
- [الأسئلة المفهمة حول اكتشاف الجهاز](device-discovery-faq.md)
