---
title: نظرة عامة على اكتشاف الجهاز
description: تعرف على كيفية الاستفادة من اكتشاف نقطة النهاية في Microsoft 365 Defender للعثور على الأجهزة غير المدارة في شبكتك
keywords: اكتشاف الجهاز واكتشافه وسلبيته واستباقيته وشبكته ورؤيته وخادمه ومحطة العمل وإلحاقه بالأجهزة غير المدارة
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
f1.keywords:
- NOCSH
ms.author: siosulli
author: mjcaparas
ms.localizationpriority: medium
manager: dansimp
audience: ITPro
ms.collection:
- M365-security-compliance
- m365initiative-m365-defender
- m365-initiative-defender-endpoint
ms.custom: admindeeplinkDEFENDER
ms.topic: conceptual
ms.technology: m365d
ms.openlocfilehash: 53a23751fd53b05b51bf1125dcca98c23f4ba73c
ms.sourcegitcommit: ebbe8713297675db5dcb3e0d9c3ae5e746b99196
ms.translationtype: MT
ms.contentlocale: ar-SA
ms.lasthandoff: 05/14/2022
ms.locfileid: "65418237"
---
# <a name="device-discovery-overview"></a>نظرة عامة على اكتشاف الجهاز

[!INCLUDE [Microsoft 365 Defender rebranding](../../includes/microsoft-defender.md)]

**ينطبق على:**
- [Defender for Endpoint الخطة 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)
- [Microsoft 365 Defender](https://go.microsoft.com/fwlink/?linkid=2118804)

تتطلب حماية بيئتك إجراء جرد للأجهزة الموجودة في شبكتك. ومع ذلك، غالبا ما يكون تعيين الأجهزة في الشبكة مكلفا وصعبا ويستغرق وقتا طويلا.

يوفر Microsoft Defender لنقطة النهاية إمكانية اكتشاف الجهاز التي تساعدك على العثور على أجهزة غير مدارة متصلة بشبكة شركتك دون الحاجة إلى أجهزة إضافية أو تغييرات عملية مرهقة. يستخدم اكتشاف الجهاز نقاط النهاية الملحقة، في شبكتك لجمع الشبكة أو فحصها أو فحصها لاكتشاف الأجهزة غير المدارة. تتيح لك إمكانية اكتشاف الجهاز اكتشاف:

- نقاط نهاية المؤسسة (محطات العمل والخوادم والأجهزة المحمولة) التي لم يتم إلحاقها بعد Microsoft Defender لنقطة النهاية
- أجهزة الشبكة مثل أجهزة التوجيه والمفاتيح
- أجهزة IoT مثل الطابعات والكاميرات

تقدم الأجهزة غير المعروفة وغير المدارة مخاطر كبيرة على شبكتك - سواء كانت طابعة غير مصححة أو أجهزة شبكة ذات تكوينات أمان ضعيفة أو خادما لا يحتوي على عناصر تحكم في الأمان. بمجرد اكتشاف الأجهزة، يمكنك:

- إلحاق نقاط النهاية غير المدارة للخدمة، ما يزيد من رؤية الأمان عليها.
- تقليل سطح الهجوم عن طريق تحديد الثغرات الأمنية وتقييمها، والكشف عن فجوات التكوين.

شاهد هذا الفيديو للحصول على نظرة عامة سريعة حول كيفية اكتشاف الجهاز:

> [!VIDEO https://www.microsoft.com/en-us/videoplayer/embed/RWORdQ]

وتزامنا مع هذه الإمكانية، تتوفر توصية أمان لإلحاق الأجهزة Microsoft Defender لنقطة النهاية كجزء من تجربة إدارة المخاطر والثغرات الأمنية الحالية.

## <a name="discovery-methods"></a>أساليب الاكتشاف

يمكنك اختيار وضع الاكتشاف لاستخدامه من قبل الأجهزة الملحقة. يتحكم الوضع في مستوى الرؤية الذي يمكنك الحصول عليه للأجهزة غير المدارة في شبكة شركتك.

يتوفر وضعان من الاكتشاف:

- **الاكتشاف الأساسي**: في هذا الوضع، ستجمع نقاط النهاية الأحداث في شبكتك بشكل سلبي وتستخرج معلومات الجهاز منها. يستخدم الاكتشاف الأساسي SenseNDR.exe الثنائي لجمع بيانات الشبكة الخاملة ولن يتم بدء حركة مرور الشبكة. ستستخرج نقاط النهاية ببساطة البيانات من كل نسبة استخدام الشبكة التي يراها جهاز تم إلحاقه. مع الاكتشاف الأساسي، لن تحصل إلا على رؤية محدودة لنقاط النهاية غير المدارة في شبكتك.

- **الاكتشاف القياسي** (مستحسن): يسمح هذا الوضع لنقاط النهاية بالعثور بنشاط على الأجهزة في شبكتك لإثراء البيانات المجمعة واكتشاف المزيد من الأجهزة - مما يساعدك على إنشاء مخزون جهاز موثوق ومتسق. بالإضافة إلى الأجهزة التي تمت ملاحظتها باستخدام الأسلوب السلبي، يستفيد الوضع القياسي أيضا من بروتوكولات الاكتشاف الشائعة التي تستخدم استعلامات الإرسال المتعدد في الشبكة للعثور على المزيد من الأجهزة. يستخدم الوضع القياسي فحصا ذكيا ونشطا لاكتشاف معلومات إضافية حول الأجهزة التي تمت ملاحظتها لإثراء معلومات الجهاز الموجودة. عند تمكين الوضع القياسي، قد تتم ملاحظة الحد الأدنى من نشاط الشبكة الذي تم إنشاؤه بواسطة مستشعر الاكتشاف بواسطة أدوات مراقبة الشبكة في مؤسستك.

يمكنك تغيير إعدادات الاكتشاف وتخصيصها، لمزيد من المعلومات، راجع [تكوين اكتشاف الجهاز](configure-device-discovery.md).

> [!IMPORTANT]
> الاكتشاف القياسي هو الوضع الافتراضي لجميع العملاء بدءا من 19 يوليو 2021. يمكنك اختيار تغيير هذا التكوين إلى أساسي من خلال صفحة الإعدادات. إذا اخترت الوضع الأساسي، فستحصل فقط على رؤية محدودة لنقاط النهاية غير المدارة في شبكتك.

> [!NOTE]
> يميز محرك الاكتشاف بين أحداث الشبكة التي يتم تلقيها في شبكة الشركة مقابل خارج شبكة الشركة. لن يتم اكتشاف الأجهزة غير المتصلة بشبكات الشركة أو إدراجها في مخزون الجهاز.

## <a name="device-inventory"></a>بيانات الجهاز

سيتم إدراج الأجهزة التي تم اكتشافها ولكن لم يتم إلحاقها وتأمينها بواسطة Microsoft Defender لنقطة النهاية في مخزون الجهاز ضمن علامة التبويب "أجهزة الكمبيوتر" و"الجوال".

لتقييم هذه الأجهزة، يمكنك استخدام عامل تصفية في قائمة مخزون الأجهزة يسمى حالة الإلحاق، والتي يمكن أن تحتوي على أي من القيم التالية:

- تم إلحاقها: يتم إلحاق نقطة النهاية Microsoft Defender لنقطة النهاية.
- يمكن إلحاقها: تم اكتشاف نقطة النهاية في الشبكة وتم تعريف نظام التشغيل على أنه نظام مدعوم من قبل Microsoft Defender لنقطة النهاية، ولكنه غير ملحق حاليا. نوصي بشدة بإلحاق هذه الأجهزة.
- غير معتمد: تم اكتشاف نقطة النهاية في الشبكة ولكنها غير معتمدة من قبل Microsoft Defender لنقطة النهاية.
- معلومات غير كافية: تعذر على النظام تحديد إمكانية دعم الجهاز. يمكن أن يؤدي تمكين الاكتشاف القياسي على المزيد من الأجهزة في الشبكة إلى إثراء السمات المكتشفة.

:::image type="content" source="images/2b62255cd3a9dd42f3219e437b956fb9.png" alt-text="لوحة معلومات مخزون الجهاز" lightbox="images/2b62255cd3a9dd42f3219e437b956fb9.png":::

> [!TIP]
> يمكنك دائما تطبيق عوامل التصفية لاستبعاد الأجهزة غير المدارة من قائمة مخزون الأجهزة. يمكنك أيضا استخدام عمود حالة الإلحاق في استعلامات واجهة برمجة التطبيقات لتصفية الأجهزة غير المدارة.

لمزيد من المعلومات، راجع [مخزون الجهاز](machines-view-overview.md).

## <a name="network-device-discovery"></a>اكتشاف جهاز الشبكة

ينشئ العدد الكبير من أجهزة الشبكة غير المدارة المنشورة في مؤسسة مساحة كبيرة من الهجوم، ويمثل خطرا كبيرا على المؤسسة بأكملها. يساعدك Microsoft Defender لنقطة النهاية قدرات اكتشاف الشبكة على ضمان اكتشاف أجهزة الشبكة وتصنيفها بدقة وإضافتها إلى مخزون الأصول.

لا تتم إدارة أجهزة الشبكة كنقاط نهاية قياسية، حيث لا يحتوي Defender لنقطة النهاية على مستشعر مضمن في أجهزة الشبكة نفسها. تتطلب هذه الأنواع من الأجهزة نهجا بدون عامل حيث سيحصل الفحص عن بعد على المعلومات اللازمة من الأجهزة. للقيام بذلك، سيتم استخدام جهاز Microsoft Defender لنقطة النهاية معين على كل مقطع شبكة لإجراء عمليات مسح دورية مصادق عليها لأجهزة الشبكة المكونة مسبقا. بمجرد اكتشافها، توفر قدرات إدارة المخاطر والثغرات الأمنية ل Defender لنقطة النهاية مهام سير عمل متكاملة لتأمين مفاتيح التبديل المكتشفة وأجهزة التوجيه ووحدات تحكم WLAN وجدران الحماية وبوابات VPN المكتشفة.

لمزيد من المعلومات، راجع [أجهزة الشبكة](network-devices.md).

## <a name="device-discovery-integrations"></a>عمليات تكامل اكتشاف الجهاز

لمعالجة التحدي المتمثل في الحصول على رؤية كافية لتحديد موقع مخزون أصول OT/IOT الكامل وتحديده وتأمينه Microsoft Defender لنقطة النهاية يدعم الآن عمليات التكامل التالية:

- **Corelight**: قامت Microsoft بالشراكة مع Corelight لتلقي البيانات من أجهزة شبكة Corelight. وهذا يوفر Microsoft 365 Defender مع رؤية متزايدة لأنشطة الشبكة للأجهزة غير المدارة، بما في ذلك الاتصال بالأجهزة الأخرى غير المدارة أو الشبكات الخارجية. لمزيد من المعلومات، راجع [تمكين تكامل بيانات Corelight](corelight-integration.md).

- **Microsoft Defender ل IoT**: يجمع هذا التكامل بين قدرات اكتشاف جهاز Microsoft Defender لنقطة النهاية، وقدرات المراقبة بدون عامل من Microsoft Defender ل IoT، لتأمين أجهزة IoT للمؤسسات المتصلة بشبكة تكنولوجيا المعلومات (على سبيل المثال، بروتوكول الصوت عبر الإنترنت (VoIP)، والطابعات، وأجهزة TV الذكية). لمزيد من المعلومات، راجع [تمكين Microsoft Defender لدمج IoT](enable-microsoft-defender-for-iot-integration.md).

## <a name="vulnerability-assessment-on-discovered-devices"></a>تقييم الثغرات الأمنية على الأجهزة المكتشفة

تعد الثغرات الأمنية والمخاطر على أجهزتك بالإضافة إلى الأجهزة الأخرى غير المدارة المكتشفة في الشبكة جزءا من تدفقات أجهزة التلفزيون الحالية ضمن "التوصيات الأمان" ويتم تمثيلها في صفحات الكيان عبر المدخل.
ابحث عن توصيات الأمان ذات الصلة ب "SSH" للعثور على الثغرات الأمنية SSH المرتبطة بالأجهزة غير المدارة والمدارة.

:::image type="content" source="images/1156c82ffadd356ce329d1cf551e806c.png" alt-text="لوحة معلومات توصيات الأمان" lightbox="images/1156c82ffadd356ce329d1cf551e806c.png":::

## <a name="use-advanced-hunting-on-discovered-devices"></a>استخدام التتبع المتقدم على الأجهزة المكتشفة

يمكنك استخدام استعلامات التتبع المتقدمة للحصول على رؤية على الأجهزة المكتشفة. يمكنك العثور على تفاصيل حول الأجهزة المكتشفة في جدول DeviceInfo، أو المعلومات المتعلقة بالشبكة حول تلك الأجهزة في جدول DeviceNetworkInfo.

:::image type="content" source="images/f48ba1779eddee9872f167453c24e5c9.png" alt-text="صفحة التتبع المتقدم التي يمكن استخدام الاستعلامات عليها" lightbox="images/f48ba1779eddee9872f167453c24e5c9.png":::

### <a name="query-discovered-devices-details"></a>تفاصيل الأجهزة المكتشفة للاستعلام

قم بتشغيل هذا الاستعلام، على جدول DeviceInfo، لإرجاع جميع الأجهزة المكتشفة مع أحدث التفاصيل لكل جهاز:

```query
DeviceInfo
| summarize arg_max(Timestamp, *) by DeviceId  // Get latest known good per device Id
| where isempty(MergedToDeviceId) // Remove invalidated/merged devices
| where OnboardingStatus != "Onboarded"
```

من خلال استدعاء الدالة **SeenBy** ، في استعلام التتبع المتقدم، يمكنك الحصول على تفاصيل حول الجهاز الملحق الذي شاهده الجهاز المكتشف. يمكن أن تساعد هذه المعلومات في تحديد موقع الشبكة لكل جهاز مكتشف، ثم تساعد في التعرف عليه في الشبكة.

```query
DeviceInfo
| where OnboardingStatus != "Onboarded"
| summarize arg_max(Timestamp, *) by DeviceId 
| where isempty(MergedToDeviceId) 
| limit 100
| invoke SeenBy()
| project DeviceId, DeviceName, DeviceType, SeenBy
```

لمزيد من المعلومات، راجع الدالة [SeeBy()](/microsoft-365/security/defender/advanced-hunting-seenby-function) .

### <a name="query-network-related-information"></a>الاستعلام عن المعلومات المتعلقة بشبكة الاتصال

يستفيد اكتشاف الجهاز من Microsoft Defender لنقطة النهاية الأجهزة الملحقة كمصدر بيانات الشبكة لسمة الأنشطة إلى الأجهزة غير الملحقة. يحدد مستشعر الشبكة على الجهاز Microsoft Defender لنقطة النهاية المضمن نوعي اتصال جديدين:

- ConnectionAttempt - محاولة لتأسيس اتصال TCP (syn)
- ConnectionAcknowledged - إقرار بقبول اتصال TCP (syn\ack)

وهذا يعني أنه عندما يحاول جهاز غير ملحق الاتصال بجهاز Microsoft Defender لنقطة النهاية تم إلحاقه، ستنشئ المحاولة DeviceNetworkEvent ويمكن رؤية أنشطة الجهاز غير الملحقة على المخطط الزمني للجهاز الملحق، ومن خلال جدول DeviceNetworkEvents للتتبع المتقدم.

يمكنك تجربة هذا الاستعلام المثال:

```text
DeviceNetworkEvents
| where ActionType == "ConnectionAcknowledged" or ActionType == "ConnectionAttempt"
| take 10
```

## <a name="next-steps"></a>الخطوات التالية

- [تكوين اكتشاف الجهاز](configure-device-discovery.md)
- [الأسئلة المتداولة حول اكتشاف الجهاز](device-discovery-faq.md)
