---
title: Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز
description: يوفر هذا الموضوع إرشادات حول Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
ms.author: dansimp
author: dansimp
ms.localizationpriority: medium
ms.date: 07/21/2022
manager: dansimp
audience: ITPro
ms.collection: M365-security-compliance
ms.topic: conceptual
ms.technology: mde
ms.openlocfilehash: 42e31e8194464654176de02cb9f45f11066c6d4e
ms.sourcegitcommit: 5aed330d8af523f0dffe5e392f1c79f047e38172
ms.translationtype: MT
ms.contentlocale: ar-SA
ms.lasthandoff: 07/21/2022
ms.locfileid: "66943651"
---
# <a name="microsoft-defender-for-endpoint-device-control-device-installation"></a>Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز

**ينطبق على**
- [الخطة 1 من Microsoft Defender لنقطة النهاية](https://go.microsoft.com/fwlink/p/?linkid=2154037)
- [Defender for Endpoint الخطة 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)

يمكنك Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز من تنفيذ المهمة التالية:

- منع الأشخاص من تثبيت أجهزة معينة.
- السماح للأشخاص بتثبيت أجهزة معينة ولكن منع الأجهزة الأخرى.

> [!NOTE]
> للعثور على الفرق بين تثبيت الجهاز والتحكم في الوصول إلى التخزين القابل للإزالة، راجع [Microsoft Defender لنقطة النهاية Device Control Removable Storage Protection](/microsoft-365/security/defender-endpoint/device-control-removable-storage-protection?view=o365-worldwide&preserve-view=true).

|امتياز|اذن|
|---|---|
|وصول|تثبيت الجهاز |
|وضع الإجراء|السماح، منع |
|دعم موفر الخدمات المشتركة (CSP)|نعم|
|دعم عنصر نهج المجموعة|نعم|
|الدعم المستند إلى المستخدم|لا|
|الدعم المستند إلى الجهاز|نعم|

## <a name="prepare-your-endpoints"></a>إعداد نقاط النهاية

نشر تثبيت الجهاز على Windows 10 وأجهزة Windows 11 وWindows Server 2022.

## <a name="device-properties"></a>خصائص الجهاز

يتم دعم خصائص الجهاز التالية بواسطة دعم تثبيت الجهاز:

- معرف الجهاز
- معرف الجهاز
- معرف متوافق
- فئة الجهاز
- نوع الجهاز "جهاز قابل للإزالة": يمكن تصنيف بعض الأجهزة على أنها جهاز قابل للإزالة. يعتبر الجهاز قابلا للإزالة عندما يشير برنامج تشغيل الجهاز المتصل به إلى أن الجهاز قابل للإزالة. على سبيل المثال، يتم الإبلاغ عن أن جهاز USB قابل للإزالة من قبل برامج التشغيل الخاصة بمركز USB الذي يتصل به الجهاز.

لمزيد من المعلومات، راجع [تثبيت الجهاز في Windows](/windows/client-management/manage-device-installation-with-group-policy).

## <a name="policies"></a>السياسات

### <a name="allow-installation-of-devices-that-match-any-of-these-device-ids"></a>السماح بتثبيت الأجهزة التي تطابق أي من معرفات الأجهزة هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بمعرفات الأجهزة أجهزة التوصيل و التشغيل ومعرفات متوافقة للأجهزة التي يسمح ل Windows بتثبيتها. إعداد النهج هذا مخصص للاستخدام فقط عند تمكين **ترتيب تقييم تطبيق الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعدادات نهج معايير مطابقة الجهاز** .

عند تمكين إعداد النهج هذا مع **تطبيق ترتيب تقييم الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعداد نهج معايير مطابقة الأجهزة**، يسمح ل Windows بتثبيت أو تحديث أي جهاز يظهر معرف جهازه أجهزة التوصيل و التشغيل أو معرفه المتوافق في القائمة التي تقوم بإنشائها، ما لم يمنع إعداد نهج آخر في الطبقة نفسها أو الأعلى في التسلسل الهيكلي ذلك بشكل خاص  التثبيت، مثل إعدادات النهج التالية:

- منع تثبيت الأجهزة التي تطابق معرفات الجهاز هذه.
- منع تثبيت الأجهزة التي تطابق أي من معرفات مثيل الجهاز هذه.

إذا لم يتم تمكين **ترتيب تقييم تطبيق الطبقات لنهج تثبيت السماح والمنع عبر كافة إعدادات نهج معايير مطابقة الجهاز** مع إعداد النهج هذا، فإن أي إعدادات نهج أخرى تمنع التثبيت بشكل خاص ستكون لها الأسبقية.

> [!NOTE]
> تم استبدال **"منع تثبيت الأجهزة" الذي لم يتم وصفه بإعداد نهج إعدادات النهج الآخر** **بترتيب تقييم تطبيق الطبقات لنهج تثبيت "السماح" و"منع" الجهاز عبر كافة إعداد نهج معايير مطابقة الأجهزة** لإصدارات Windows 10 الهدف المعتمدة Windows 11. يوصى باستخدام **ترتيب تقييم تطبيق الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعدادات نهج معايير مطابقة الجهاز** عندما يكون ذلك ممكنا.

### <a name="allow-installation-of-devices-that-match-any-of-these-device-instance-ids"></a>السماح بتثبيت الأجهزة التي تطابق أي من معرفات مثيل الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بمعرفات مثيل جهاز أجهزة التوصيل و التشغيل للأجهزة المسموح ل Windows بتثبيتها. إعداد النهج هذا مخصص للاستخدام فقط عند تمكين **ترتيب تقييم تطبيق الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعدادات نهج معايير مطابقة الجهاز** .

عند تمكين إعداد النهج هذا مع **ترتيب التقييم "تطبيق الطبقات" لنهج تثبيت "السماح" و"منع" الجهاز عبر كافة إعداد نهج معايير مطابقة الجهاز**، يسمح ل Windows بتثبيت أو تحديث أي جهاز يظهر معرف مثيل جهازه أجهزة التوصيل و التشغيل في القائمة التي تقوم بإنشائها، ما لم يمنع إعداد نهج آخر في الطبقة نفسها أو الأعلى في التسلسل الهيكلي هذا التثبيت بشكل خاص،  مثل إعدادات النهج التالية:

- منع تثبيت الأجهزة التي تطابق أي من معرفات مثيل الجهاز هذه

إذا لم يتم تمكين **ترتيب تقييم تطبيق الطبقات لنهج تثبيت السماح والمنع عبر كافة إعدادات نهج معايير مطابقة الجهاز** مع إعداد النهج هذا، فإن أي إعدادات نهج أخرى تمنع التثبيت بشكل خاص ستكون لها الأسبقية.

### <a name="allow-installation-of-devices-using-drivers-that-match-these-device-setup-classes"></a>السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بفئة إعداد الجهاز المعرفات الفريدة العمومية (GUIDs) لحزم برامج التشغيل التي يسمح لنظام التشغيل Windows بتثبيتها. إعداد النهج هذا مخصص للاستخدام فقط عند تمكين **ترتيب تقييم تطبيق الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعدادات نهج معايير مطابقة الجهاز** .

عند تمكين إعداد النهج هذا مع **ترتيب التقييم "تطبيق الطبقات" لنهج تثبيت "السماح" و"منع" الجهاز عبر كافة إعداد نهج معايير مطابقة الأجهزة** ، يسمح ل Windows بتثبيت حزم برامج التشغيل أو تحديثها التي تظهر فيها معرفات واجهة المستخدم الرسومية لفئة إعداد الجهاز في القائمة التي تقوم بإنشائها، ما لم يمنع إعداد نهج آخر في الطبقة نفسها أو الأعلى في التسلسل الهيكلي هذا التثبيت بشكل خاص،  مثل إعدادات النهج التالية:

- منع تثبيت الأجهزة لفئات الأجهزة هذه
- منع تثبيت الأجهزة التي تطابق معرفات الجهاز هذه
- منع تثبيت الأجهزة التي تطابق أي من معرفات مثيل الجهاز هذه

إذا لم يتم تمكين **ترتيب تقييم تطبيق الطبقات لنهج تثبيت السماح والمنع عبر كافة إعدادات نهج معايير مطابقة الجهاز** مع إعداد النهج هذا، فإن أي إعدادات نهج أخرى تمنع التثبيت بشكل خاص ستكون لها الأسبقية.

### <a name="apply-layered-order-of-evaluation-for-allow-and-prevent-device-installation-policies-across-all-device-match-criteria"></a>تطبيق ترتيب تقييم متعدد الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر جميع معايير مطابقة الجهاز

سيؤدي إعداد النهج هذا إلى تغيير ترتيب التقييم الذي يتم تطبيق إعدادات النهج "السماح" و"منعه" عند تطبيق أكثر من إعداد نهج تثبيت واحد على جهاز معين. قم بتمكين إعداد النهج هذا للتأكد من تطبيق معايير مطابقة الجهاز المتراكب استنادا إلى تسلسل هيكلي محدد حيث تحل معايير المطابقة الأكثر تحديدا محل معايير مطابقة أقل تحديدا. الترتيب الهرمي للتقييم لإعدادات النهج التي تحدد معايير مطابقة الجهاز هو كما يلي:

**معرفات مثيل الجهاز** \> **معرفات** \> الجهاز **فئة** \> إعداد الجهاز **الأجهزة القابلة للإزالة**

#### <a name="device-instance-ids"></a>معرفات مثيل الجهاز

1. منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق معرفات مثيل الجهاز هذه.
2. السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تطابق معرفات مثيل الجهاز هذه.

#### <a name="device-ids"></a>معرفات الجهاز

1. منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق معرفات الجهاز هذه.
2. السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تطابق معرفات الجهاز هذه.

#### <a name="device-setup-class"></a>فئة إعداد الجهاز

1. منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه.
2. السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه.

#### <a name="removable-devices"></a>الأجهزة القابلة للإزالة

منع تثبيت الأجهزة القابلة للإزالة

> [!NOTE]
> يوفر إعداد النهج هذا تحكما أكثر دقة من **منع تثبيت الأجهزة التي لم يتم وصفها بواسطة إعداد نهج إعدادات النهج الأخرى** . إذا تم تمكين إعدادات النهج المتضاربة هذه في الوقت نفسه، فسيتم تمكين **تطبيق ترتيب تقييم متعدد الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعدادات نهج معايير مطابقة الجهاز** وسيتم تجاهل إعداد النهج الآخر.

### <a name="prevent-installation-of-devices-that-match-any-of-these-device-ids"></a>منع تثبيت الأجهزة التي تطابق أي من معرفات الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بمعرفات الأجهزة أجهزة التوصيل و التشغيل ومعرفات متوافقة للأجهزة التي تم منع Windows من تثبيتها. بشكل افتراضي، يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر يسمح لنظام التشغيل Windows بتثبيت جهاز.

> [!NOTE]
> لتمكين **السماح بتثبيت الأجهزة التي تتطابق مع أي من إعداد نهج معرفات مثيل الجهاز هذا** لتجاوز إعداد النهج هذا للأجهزة القابلة للتطبيق، قم **بتمكين تطبيق ترتيب الطبقات للتقييم لنهج تثبيت الجهاز السماح ومنعه عبر كافة إعداد نهج معايير مطابقة الجهاز** .

إذا قمت بتمكين إعداد النهج هذا، يتم منع Windows من تثبيت جهاز يظهر معرف أجهزته أو معرفه المتوافق في القائمة التي تقوم بإنشائها. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة المحددة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو لم تقم بتكوينه، يمكن تثبيت الأجهزة وتحديثها كما هو مسموح به أو تمنعه إعدادات النهج الأخرى.

### <a name="prevent-installation-of-devices-that-match-any-of-these-device-instance-ids"></a>منع تثبيت الأجهزة التي تطابق أي من معرفات مثيل الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة أجهزة التوصيل و التشغيل معرفات مثيل الجهاز للأجهزة التي تم منع Windows من تثبيتها. يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر يسمح لنظام التشغيل Windows بتثبيت جهاز.

إذا قمت بتمكين إعداد النهج هذا، يتم منع Windows من تثبيت جهاز يظهر معرف مثيل جهازه في القائمة التي تقوم بإنشائها. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة المحددة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو لم تقم بتكوينه، يمكن تثبيت الأجهزة وتحديثها كما هو مسموح به أو تمنعه إعدادات النهج الأخرى.

### <a name="prevent-installation-of-devices-using-drivers-that-match-these-device-setup-classes"></a>منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بفئة إعداد الجهاز المعرفات الفريدة العمومية (GUIDs) لحزم برامج التشغيل التي تم منع Windows من تثبيتها. بشكل افتراضي، يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر يسمح لنظام التشغيل Windows بتثبيت جهاز.

> [!NOTE]
> لتمكين **السماح بتثبيت الأجهزة التي تتطابق مع أي من معرفات الجهاز هذه** **والسماح بتثبيت الأجهزة التي تطابق أي من إعدادات نهج معرفات مثيل الجهاز هذه** لتجاوز إعداد النهج هذا للأجهزة القابلة للتطبيق، قم **بتمكين تطبيق ترتيب متعدد الطبقات للتقييم لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعداد نهج معايير مطابقة الجهاز** .

إذا قمت بتمكين إعداد النهج هذا، يتم منع Windows من تثبيت حزم برامج التشغيل أو تحديثها التي تظهر معرفات واجهة المستخدم الرسومية الخاصة بإعداد الجهاز في القائمة التي تقوم بإنشائها. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة المحددة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو لم تقم بتكوينه، يمكن ل Windows تثبيت الأجهزة وتحديثها كما هو مسموح به أو تمنعه إعدادات النهج الأخرى.

### <a name="prevent-installation-of-removable-devices"></a>منع تثبيت الأجهزة القابلة للإزالة

يسمح لك إعداد النهج هذا بمنع Windows من تثبيت الأجهزة القابلة للإزالة. يعتبر الجهاز قابلا للإزالة عندما يشير برنامج تشغيل الجهاز المتصل به إلى أن الجهاز قابل للإزالة. على سبيل المثال، يتم الإبلاغ عن جهاز الناقل التسلسلي العالمي (USB) ليكون قابلا للإزالة من قبل برامج التشغيل لمركز USB الذي يتصل به الجهاز. بشكل افتراضي، يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر يسمح لنظام التشغيل Windows بتثبيت جهاز.

> [!NOTE]
> لتمكين **السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه**، **اسمح بتثبيت الأجهزة التي تطابق أي من معرفات الجهاز هذه**، **واسمح بتثبيت الأجهزة التي تطابق أي من إعدادات نهج معرفات مثيل الجهاز هذه** لتجاوز إعداد النهج هذا للأجهزة القابلة للتطبيق، وقم **بتمكين تطبيق ترتيب متعدد الطبقات للتقييم لنهج السماح بتثبيت الجهاز ومنعه عبر كافة إعدادات نهج معايير مطابقة الجهاز** .

إذا قمت بتمكين إعداد النهج هذا، يتم منع Windows من تثبيت الأجهزة القابلة للإزالة ولا يمكن تحديث برامج تشغيل الأجهزة القابلة للإزالة الموجودة. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة القابلة للإزالة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو عدم تكوينه، يمكن ل Windows تثبيت حزم برامج التشغيل وتحديثها للأجهزة القابلة للإزالة كما هو مسموح به أو تم منعه بواسطة إعدادات النهج الأخرى.

## <a name="common-removable-storage-access-control-scenarios"></a>سيناريوهات التحكم في الوصول إلى التخزين القابلة للإزالة الشائعة

لمساعدتك في التعرف على Microsoft Defender لنقطة النهاية التحكم في الوصول إلى التخزين القابل للإزالة، قمنا بتجميع بعض السيناريوهات الشائعة لمتابعتها.

### <a name="scenario-1-prevent-installation-of-all-usb-devices-while-allowing-an-installation-of-only-an-authorized-usb-thumb-drive"></a>السيناريو 1: منع تثبيت جميع أجهزة USB مع السماح بتثبيت محرك أقراص USB معتمد فقط

بالنسبة لهذا السيناريو، سيتم استخدام النهج التالية:

- منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه.
- تطبيق ترتيب تقييم متعدد الطبقات لنهج السماح بتثبيت الجهاز ومنعه عبر جميع معايير مطابقة الجهاز.
- السماح بتثبيت الأجهزة التي تطابق أي من معرفات مثيل الجهاز هذه أو السماح بتثبيت الأجهزة التي تطابق أي من معرفات الجهاز هذه.

#### <a name="deploying-and-managing-policy-via-intune"></a>نشر النهج وإدارته عبر Intune

تسمح لك ميزة تثبيت الجهاز بتطبيق النهج من خلال Intune على الجهاز.

#### <a name="licensing"></a>الترخيص

قبل البدء في تثبيت الجهاز، يجب عليك تأكيد [اشتراكك في Microsoft 365](https://www.microsoft.com/en-in/microsoft-365/compare-microsoft-365-enterprise-plans?rtc=2). للوصول إلى تثبيت الجهاز واستخدامه، يجب أن يكون لديك Microsoft 365 E3.

#### <a name="permission"></a>اذن

لنشر النهج في Intune، يجب أن يكون للحساب أذونات لإنشاء ملفات تعريف تكوين الجهاز أو تحريرها أو تحديثها أو حذفها. يمكنك إنشاء أدوار مخصصة أو استخدام أي من الأدوار المضمنة باستخدام هذه الأذونات:

- دور إدارة النهج وملفات التعريف
- أو دور مخصص مع تشغيل أذونات إنشاء/تحرير/تحديث/قراءة/حذف/عرض التقارير لملفات تعريف تكوين الجهاز
- أو المسؤول العام

#### <a name="deploying-policy"></a>نهج النشر

في Microsoft إدارة نقاط النهاية [https://endpoint.microsoft.com/](https://endpoint.microsoft.com/)

1. تكوين **منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق فئات إعداد الجهاز هذه**.

    فتح خفض  > **سطح هجوم** **أمان** >  نقطة النهاية إنشاء **نظام أساسي للنهج: Windows 10 (والإي وقت لاحق) ملف تعريف &: التحكم في الجهاز**. > 

      :::image type="content" source="../../media/devicepolicy-editprofile.png" alt-text="صفحة تحرير ملف التعريف" lightbox="../../media/devicepolicy-editprofile.png":::

2. قم بتوصيل USB وجهاز وسترى رسالة الخطأ التالية:

      :::image type="content" source="../../media/devicepolicy-errormsg.png" alt-text="رسالة الخطأ" lightbox="../../media/devicepolicy-errormsg.png":::

3. تمكين **تطبيق ترتيب متعدد الطبقات للتقييم لنهج السماح بتثبيت الجهاز ومنعه عبر جميع معايير مطابقة الجهاز**.

    **دعم OMA-URI فقط في الوقت الحالي**:**ملفات تعريف تكوين** **الأجهزة** > **إنشاء نظام أساسي لملف التعريف** > **: Windows 10 (والإصدارات الأحدث) ملف تعريف &: مخصص** > 

      :::image type="content" source="../../media/devicepolicy-editrow.png" alt-text="صفحة تحرير الصف" lightbox="../../media/devicepolicy-editrow.png":::

4. تمكين معرف مثيل USB المسموح به وإضافته – **السماح بتثبيت الأجهزة التي تطابق أي من معرفات الجهاز هذه**.

    تحديث ملف تعريف عنصر تحكم الجهاز من الخطوة 1.

      :::image type="content" source="../../media/devicepolicy-devicecontrol.png" alt-text="معرف في صفحة التحكم في الجهاز" lightbox="../../media/devicepolicy-devicecontrol.png":::

    إن الإضافة `PCI\CC_0C03; PCI\CC_0C0330; PCI\VEN_8086; PNP0CA1; PNP0CA1&HOST; USB\ROOT_HUB30; USB\ROOT_HUB20; USB\USB20_HUB` كما هو موضح في الصورة السابقة غير كافية لتمكين معرف جهاز واحد فقط لتمكين محرك أقراص USB مصغر واحد. يجب التأكد من أن جميع أجهزة USB التي تسبق جهاز الهدف غير محظورة (مسموح بها) أيضا. يمكنك فتح إدارة الأجهزة وتغيير طريقة العرض إلى **الأجهزة بواسطة الاتصالات** لرؤية طريقة تثبيت الأجهزة في شجرة PnP. في هذه الحالة، يجب السماح بالأجهزة التالية حتى يمكن السماح بمحرك أقراص USB الإبهام الهدف أيضا:

    - "Intel(R) USB 3.0 eXtensible Host Controller – 1.0 (Microsoft)" -> PCI\CC_0C03
    - "USB Root Hub (USB 3.0)" -> USB\ROOT_HUB30
    - "مركز USB عام" -> USB\USB20_HUB

    :::image type="content" source="../../media/devicepolicy-devicemgr.png" alt-text="عنصر القائمة &quot;عرض&quot; في صفحة إدارة الأجهزة" lightbox="../../media/devicepolicy-devicemgr.png":::

    > [!NOTE]
    > تحتوي بعض الأجهزة في النظام على عدة طبقات من الاتصال لتحديد تثبيتها على النظام. محركات أقراص USB الإبهام هي مثل هذه الأجهزة. ومن ثم، عند البحث عن حظر أو السماح بها على نظام، من المهم فهم مسار الاتصال لكل جهاز. هناك العديد من معرفات الأجهزة العامة التي تستخدم عادة في الأنظمة ويمكن أن توفر بداية جيدة لإنشاء "قائمة السماح" في مثل هذه الحالات. فيما يلي مثال واحد (ليس دائما هو نفسه لجميع USBs؛ تحتاج إلى فهم شجرة PnP للجهاز الذي تريد إدارته من خلال إدارة الأجهزة):
    >
    > `PCI\CC_0C03; PCI\CC_0C0330; PCI\VEN_8086; PNP0CA1; PNP0CA1&HOST (for Host Controllers)/ USB\ROOT_HUB30; USB\ROOT_HUB20 (for USB Root Hubs)/ USB\USB20_HUB (for Generic USB Hubs)/`
    >
    > على وجه التحديد لأجهزة سطح المكتب، من المهم سرد جميع أجهزة USB التي يتم توصيل لوحات المفاتيح والماوس بها في القائمة أعلاه. قد يؤدي الفشل في القيام بذلك إلى منع المستخدم من الوصول إلى جهازه من خلال أجهزة HID.
    >
    > في بعض الأحيان، يكون لدى الشركات المصنعة المختلفة للكمبيوتر طرقا مختلفة لتضمين أجهزة USB في شجرة PnP، ولكن بشكل عام، هذه هي الطريقة التي يتم بها ذلك.

5. قم بتوصيل USB المسموح به مرة أخرى. سترى أنه مسموح به الآن ومتاح.

    :::image type="content" source="../../media/devicepolicy-removedrive.png" alt-text="صفحة إزالة تفاصيل محرك الأقراص" lightbox="../../media/devicepolicy-removedrive.png":::

#### <a name="deploying-and-managing-policy-via-group-policy"></a>نشر النهج وإدارته عبر نهج المجموعة

تسمح لك ميزة تثبيت الجهاز بتطبيق النهج من خلال نهج المجموعة.

#### <a name="deploying-policy"></a>نهج النشر

راجع [إدارة تثبيت الجهاز باستخدام نهج المجموعة (Windows 10) - عميل Windows](/windows/client-management/manage-device-installation-with-group-policy).

## <a name="view-device-control-removable-storage-access-control-data-in-microsoft-defender-for-endpoint"></a>عرض بيانات التحكم في الوصول إلى التخزين القابلة للإزالة لعنصر تحكم الجهاز في Microsoft Defender لنقطة النهاية

يعرض [مدخل Microsoft 365 Defender](https://sip.security.microsoft.com/homepage) التخزين القابل للإزالة المحظور بواسطة تثبيت جهاز التحكم في الجهاز.

```kusto
//events triggered by Device Installation policies
DeviceEvents
| where ActionType == "PnpDeviceBlocked" or ActionType == "PnpDeviceAllowed"
| extend parsed=parse_json(AdditionalFields)
| extend MediaClassGuid = tostring(parsed.ClassGuid)
| extend MediaInstanceId = tostring(parsed.DeviceInstanceId)
| extend MediaDeviceId = tostring(parsed.MatchingDeviceId)
| project Timestamp , DeviceId, DeviceName, ActionType, MediaClassGuid, MediaDeviceId, MediaInstanceId, AdditionalFields
| order by Timestamp desc
```

:::image type="content" source="../../media/block-removable-storage2.png" alt-text="تخزين الكتلة" lightbox="../../media/block-removable-storage2.png":::

## <a name="frequently-asked-questions"></a>الأسئلة الشائعة

### <a name="how-do-i-confirm-that-a-device-gets-a-deployed-policy"></a>كيف أعمل تأكيد أن الجهاز يحصل على نهج منشور؟

يمكنك استخدام الاستعلام التالي للحصول على إصدار عميل مكافحة البرامج الضارة على مدخل Microsoft 365 Defender ([https://security.microsoft.com](https://security.microsoft.com)):

```kusto
//check whether the Device installation policy has been deployed to the target machine, event only when modification happens
DeviceRegistryEvents
| where RegistryKey contains "HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows\\DeviceInstall\\"
| order by Timestamp desc
```

## <a name="why-doesnt-the-allow-policy-work"></a>لماذا لا يعمل نهج السماح؟

لا يكفي تمكين معرف جهاز واحد فقط لتمكين محرك أقراص USB مصغر واحد. تأكد من أن جميع أجهزة USB التي تسبق أجهزة الهدف غير محظورة (مسموح بها) أيضا.

:::image type="content" source="../../media/devicemgrscrnshot.png" alt-text="الأسئلة المتداولة حول تثبيت الجهاز" lightbox="../../media/devicemgrscrnshot.png":::
