---
title: Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز
description: يوفر هذا الموضوع معلومات حول Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
ms.author: dansimp
author: lovina-saldanha
ms.localizationpriority: medium
manager: dansimp
audience: ITPro
ms.collection: M365-security-compliance
ms.topic: conceptual
ms.technology: mde
ms.openlocfilehash: ccef3ec748983db89b6ceca9b8092eafbef0d899
ms.sourcegitcommit: b0c3ffd7ddee9b30fab85047a71a31483b5c649b
ms.translationtype: MT
ms.contentlocale: ar-SA
ms.lasthandoff: 03/25/2022
ms.locfileid: "64472606"
---
# <a name="microsoft-defender-for-endpoint-device-control-device-installation"></a>Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز

**ينطبق على**
- [Microsoft Defender لنقطة النهاية 1](https://go.microsoft.com/fwlink/p/?linkid=2154037)
- [Microsoft Defender لنقطة النهاية 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)

Microsoft Defender لنقطة النهاية تثبيت جهاز التحكم في الجهاز من القيام ب المهمة التالية:

- منع الأشخاص من تثبيت أجهزة معينة.
- السماح للأشخاص بتثبيت أجهزة معينة ولكن منع الأجهزة الأخرى.

> [!NOTE]
> للعثور على الفرق بين تثبيت الجهاز والتحكم بالوصول إلى التخزين القابل للإزالة، راجع Microsoft Defender لنقطة النهاية التحكم في الجهاز [حماية التخزين القابلة للإزالة](/microsoft-365/security/defender-endpoint/device-control-removable-storage-protection?view=o365-worldwide&preserve-view=true).

|الامتياز|الإذن|
|---|---|
|وصول|تثبيت الجهاز |
|وضع الإجراء|السماح، منع |
|دعم CSP|نعم|
|دعم GPO|نعم|
|الدعم المستند إلى المستخدم|لا|
|دعم يستند إلى جهاز|نعم|

## <a name="prepare-your-endpoints"></a>تحضير نقاط النهاية

نشر تثبيت الجهاز على Windows 10 أو Windows 11 أو Windows Server 2022.

## <a name="device-properties"></a>خصائص الجهاز

يتم دعم خصائص الجهاز التالية بواسطة دعم تثبيت الجهاز:

- "معرّف الجهاز"
- "معرّف الأجهزة"
- الم ID متوافق
- فئة الجهاز
- نوع الجهاز "جهاز قابل للإزالة": يمكن تصنيف بعض الأجهزة على أنها جهاز قابل للإزالة. يعتبر الجهاز قابلا للإزالة عندما يشير برنامج تشغيل الجهاز المتصل به إلى أن الجهاز قابل للإزالة. على سبيل المثال، يتم إعلام جهاز USB بأنه قابل للإزالة بواسطة برامج التشغيل الخاصة بمحور USB المتصل به الجهاز.
لمزيد من المعلومات، راجع [تثبيت الجهاز في Windows](/windows/client-management/manage-device-installation-with-group-policy).

## <a name="policies"></a>السياسات

### <a name="allow-installation-of-devices-that-match-any-of-these-device-ids"></a>السماح بتثبيت الأجهزة التي تتطابق مع أي من "هويات الجهاز" هذه

يسمح لك إعداد النهج هذا بتحديد قائمة أجهزة التوصيل و التشغيل الأجهزة والمحددات المتوافقة للأجهزة التي Windows بتثبيتها. يتم استخدام إعداد النهج هذا فقط عندما يتم تمكين تطبيق ترتيب التقييم  الطبقي لنهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة التي تتطابق مع إعداد نهج المعايير.

عند تمكين إعداد النهج هذا مع تطبيق ترتيب التقييم الطبقي على السماح ونهج منع تثبيت الجهاز عبر كل إعداد نهج معايير مطابقة الجهاز، يتم السماح ل Windows بتثبيت أي جهاز تم تثبيته أو تحديثه أجهزة التوصيل و التشغيل   يظهر الم ID الأجهزة أو المستعرض المتوافق في القائمة التي تقوم بإنشاءها، إلا إذا منع إعداد نهج آخر في الطبقة نفسها أو أعلى في التسلسل الهيكلي هذا التثبيت تحديدا، مثل إعدادات النهج التالية:

- منع تثبيت الأجهزة التي تطابق هذه الم IDS.
- منع تثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات المثيلية للجهاز.

إذا لم  يتم تمكين تطبيق ترتيب تقييم على طبقات لنهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة مع إعداد نهج المعايير مع إعداد النهج هذا، فإن أي إعدادات نهج أخرى تمنع التثبيت بشكل خاص ستكون لها الأسبقية.

> [!NOTE]
> تم  استبدال إعداد نهج منع تثبيت الأجهزة التي لم يتم وصفها بواسطة إعدادات النهج الأخرى بالترتيب الطبقي للتقييم لتطبيق  نهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة التي تتطابق مع إعداد نهج المعايير للإصدارات المستهدفة Windows 10 والإصدارات Windows 11. من المستحسن استخدام ترتيب تقييم تطبيق تقييم على طبقات من **أجل السماح** ونهج منع تثبيت الجهاز عبر كل إعدادات نهج معايير مطابقة الجهاز عند الإمكان.

### <a name="allow-installation-of-devices-that-match-any-of-these-device-instance-ids"></a>السماح بتثبيت الأجهزة التي تطابق أي من هذه المثيلات في الأجهزة

يسمح لك إعداد النهج هذا بتحديد قائمة أجهزة التوصيل و التشغيل المثيلات للأجهزة التي Windows بتثبيتها. يتم استخدام إعداد النهج هذا فقط عندما يتم تمكين تطبيق ترتيب التقييم  الطبقي لنهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة التي تتطابق مع إعداد نهج المعايير.

عند تمكين إعداد النهج هذا مع تطبيق ترتيب التقييم الطبقي على السماح ونهج منع تثبيت الجهاز عبر كل إعداد نهج معايير مطابقة الجهاز، يتم السماح ل Windows بتثبيت أي جهاز تم تثبيته أو تحديثه أجهزة التوصيل و التشغيل   يظهر "المثيل المثيل" في القائمة التي تقوم بإنشاءها، ما لم يمنع إعداد نهج آخر في الطبقة نفسها أو أعلى في التسلسل الهيكلي هذا التثبيت تحديدا، مثل إعدادات النهج التالية:

- منع تثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات في الأجهزة

إذا لم  يتم تمكين تطبيق ترتيب تقييم على طبقات لنهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة مع إعداد نهج المعايير مع إعداد النهج هذا، فإن أي إعدادات نهج أخرى تمنع التثبيت بشكل خاص ستكون لها الأسبقية.

### <a name="allow-installation-of-devices-using-drivers-that-match-these-device-setup-classes"></a>السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بفئة إعداد الجهاز معرفات فريدة عمومية (GUIDs) لحزم برامج التشغيل التي Windows تثبيتها. يتم استخدام إعداد النهج هذا فقط عندما يتم تمكين تطبيق ترتيب التقييم  الطبقي لنهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة التي تتطابق مع إعداد نهج المعايير.

عند تمكين إعداد النهج هذا مع تطبيق ترتيب التقييم الطبقي لنهج السماح ومنع تثبيت الجهاز عبر كل إعداد نهج معايير مطابقة الجهاز، يسمح ل Windows بتثبيت أو تحديث حزم برامج التشغيل التي تظهر GUIDS لفئة إعداد الجهاز الخاصة بها في القائمة التي تقوم بإنشاءها، ما لم يمنع إعداد نهج آخر في الطبقة نفسها أو أعلى في التسلسل الهيكلي هذا التثبيت تحديدا،  مثل إعدادات النهج التالية:

- منع تثبيت الأجهزة لفئات الأجهزة هذه
- منع تثبيت الأجهزة التي تطابق هذه الم IDS
- منع تثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات في الأجهزة

إذا لم  يتم تمكين تطبيق ترتيب تقييم على طبقات لنهج السماح ومنع تثبيت الجهاز عبر كل الأجهزة مع إعداد نهج المعايير مع إعداد النهج هذا، فإن أي إعدادات نهج أخرى تمنع التثبيت بشكل خاص ستكون لها الأسبقية.

### <a name="apply-layered-order-of-evaluation-for-allow-and-prevent-device-installation-policies-across-all-device-match-criteria"></a>تطبيق ترتيب تقييم الطبقات لنهج السماح ومنع تثبيت الجهاز عبر جميع الأجهزة متطابقة مع المعايير

سيغير إعداد النهج هذا ترتيب التقييم الذي يتم من خلاله تطبيق إعدادات نهج السماح ومنع عند تطبيق أكثر من إعداد نهج تثبيت واحد على جهاز معين. تمكين إعداد النهج هذا لضمان تطبيق معايير مطابقة الجهاز المتراكبة بالاستناد إلى تسلسل هيكلي تم تأسيسه حيث تكون معايير مطابقة أكثر تحديدا فوق معايير مطابقة أقل تحديدا. يكون الترتيب الهرمي للتقييم لإعدادات النهج التي تحدد معايير مطابقة الجهاز كما يلي:

**المثيلات المثيلة للجهاز** \> **"هويات الجهاز"** \> **فئة إعداد الجهاز** \> **الأجهزة القابلة للإزالة**

#### <a name="device-instance-ids"></a>المثيلات المثيلة للجهاز

1. منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق هذه المثيلات من المثيلات.
2. السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تطابق هذه المثيلات من المثيلات.

#### <a name="device-ids"></a>"هويات الجهاز"

1. منع تثبيت الأجهزة باستخدام برامج التشغيل التي تطابق هذه الم IDS.
2. السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع هذه الملمحات.

#### <a name="device-setup-class"></a>فئة إعداد الجهاز

1. منع تثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه.
2. السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه.

#### <a name="removable-devices"></a>الأجهزة القابلة للإزالة

منع تثبيت الأجهزة القابلة للإزالة

> [!NOTE]
> يوفر إعداد النهج هذا تحكما أكثر تفردا من الإعداد منع تثبيت الأجهزة التي لم يتم وصفها **بواسطة إعداد نهج إعدادات** النهج الأخرى. إذا تم تمكين إعدادات النهج المتضاربة هذه في الوقت نفسه، سيتم تمكين تطبيق  ترتيب التقييم الطبقي لنهج تثبيت الجهاز السماح ومنعه عبر كل إعدادات نهج معايير مطابقة الجهاز، كما سيتم تجاهل إعداد النهج الآخر.

### <a name="prevent-installation-of-devices-that-match-any-of-these-device-ids"></a>منع تثبيت الأجهزة التي تتطابق مع أي من هذه الم IDS

يسمح لك إعداد النهج هذا بتحديد قائمة أجهزة التوصيل و التشغيل الأجهزة والمحددات المتوافقة للأجهزة التي لا Windows تثبيتها. بشكل افتراضي، يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر Windows تثبيت جهاز.

> [!NOTE]
> لتمكين السماح بتثبيت الأجهزة التي تتطابق مع أي من إعدادات نهج المثيلات هذه لمثيلات الأجهزة هذه لتقدم إعداد النهج هذا للأجهزة القابلة للتطبيق، قم  بتمكين تطبيق ترتيب تقييم على طبقات لنهج السماح ومنع تثبيت الجهاز عبر كل إعداد نهج معايير مطابقة الجهاز.

إذا قمت بتمكين إعداد النهج هذا، Windows من تثبيت جهاز يظهر الم ID أو الم ID المتوافق للأجهزة الخاص به في القائمة التي تقوم بإنشاءها. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة المحددة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو لم يتم تكوينه، يمكن تثبيت الأجهزة وتحديثها كما هو مسموح به أو منعها بواسطة إعدادات النهج الأخرى.

### <a name="prevent-installation-of-devices-that-match-any-of-these-device-instance-ids"></a>منع تثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات في الأجهزة

يسمح لك إعداد النهج هذا بتحديد قائمة أجهزة التوصيل و التشغيل المثيلات للأجهزة التي تم Windows تثبيتها. يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر Windows تثبيت جهاز.

إذا قمت بتمكين إعداد النهج هذا، Windows من تثبيت جهاز يظهر "المثيل المثيل" لجهازه في القائمة التي تقوم بإنشاءها. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة المحددة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو لم يتم تكوينه، يمكن تثبيت الأجهزة وتحديثها كما هو مسموح به أو منعها بواسطة إعدادات النهج الأخرى.

### <a name="prevent-installation-of-devices-using-drivers-that-match-these-device-setup-classes"></a>منع تثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه

يسمح لك إعداد النهج هذا بتحديد قائمة بفئة إعداد الجهاز معرفات فريدة عمومية (GUIDs) لحزم برامج التشغيل التي Windows تثبيتها. بشكل افتراضي، يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر Windows تثبيت جهاز.

> [!NOTE]
> لتمكين السماح بتثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات والسماح بتثبيت الأجهزة التي تتطابق مع أي من إعدادات نهج المثيلات هذه لمثيلات الأجهزة هذه لتنطبق على إعداد النهج هذا للأجهزة القابلة للتطبيق،  قم بتمكين تطبيق ترتيب التقييم الطبقي لنهج السماح ومنع تثبيت الجهاز عبر كل إعدادات نهج معايير مطابقة الجهاز. 

إذا قمت بتمكين إعداد النهج هذا، Windows من تثبيت حزم برامج التشغيل أو تحديثها التي تظهر GUIDs فئة إعداد الجهاز في القائمة التي تقوم بإنشاءها. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة المحددة من عميل سطح مكتب بعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو عدم تكوينه، Windows تثبيت الأجهزة وتحديثها كما هو مسموح به أو تم منعه بواسطة إعدادات النهج الأخرى.

### <a name="prevent-installation-of-removable-devices"></a>منع تثبيت الأجهزة القابلة للإزالة

يسمح لك إعداد النهج هذا بمنع Windows من تثبيت الأجهزة القابلة للإزالة. يعتبر الجهاز قابلا للإزالة عندما يشير برنامج تشغيل الجهاز المتصل به إلى أن الجهاز قابل للإزالة. على سبيل المثال، يتم إعلام جهاز Universal Serial Bus (USB) بأنه قابل للإزالة بواسطة برامج التشغيل الخاصة بمحور USB المتصل به الجهاز. بشكل افتراضي، يكون لإعداد النهج هذا الأسبقية على أي إعداد نهج آخر Windows تثبيت جهاز.

> [!NOTE]
> لتمكين السماح بتثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه والسماح بتثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات والسماح بتثبيت الأجهزة التي تتطابق مع أي من إعدادات نهج المثيلات هذه لمثيلات الأجهزة 2010، قم بتمكين تطبيق ترتيب التقييم الطبقي لنهج السماح وتمنع تثبيت الجهاز عبر كل إعدادات نهج معايير مطابقة الجهاز. 

إذا قمت بتمكين إعداد النهج هذا، Windows من تثبيت الأجهزة القابلة للإزالة ولا يمكن تحديث برامج التشغيل الخاصة بالأجهزة الموجودة القابلة للإزالة. إذا قمت بتمكين إعداد النهج هذا على خادم سطح مكتب بعيد، يؤثر إعداد النهج على إعادة توجيه الأجهزة القابلة للإزالة من عميل سطح المكتب البعيد إلى خادم سطح المكتب البعيد.

إذا قمت بتعطيل إعداد النهج هذا أو عدم تكوينه، Windows تثبيت حزم برامج التشغيل وتحديثها للأجهزة القابلة للإزالة كما هو مسموح به أو تم منعه بواسطة إعدادات النهج الأخرى.

## <a name="common-removable-storage-access-control-scenarios"></a>سيناريوهات "التحكم بالوصول إلى التخزين" الشائعة القابلة للإزالة

لمساعدتك على التعرف على Microsoft Defender لنقطة النهاية الوصول إلى التخزين القابل للإزالة، قمنا بوضع بعض السيناريوهات الشائعة لمتابعتها.

### <a name="scenario-1-prevent-installation-of-all-usb-devices-while-allowing-an-installation-of-only-an-authorized-usb-thumb-drive"></a>السيناريو 1: منع تثبيت جميع أجهزة USB مع السماح بتثبيت محرك أقراص USB مصغر معتمد فقط

بالنسبة إلى هذا السيناريو، سيتم استخدام السياسات التالية:

- منع تثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه.
- تطبيق ترتيب تقييم على طبقات لنهج السماح ومنع تثبيت الجهاز عبر جميع الأجهزة متطابقة مع المعايير.
- السماح بتثبيت الأجهزة التي تطابق أي من هذه المثيلات أو السماح بتثبيت الأجهزة التي تتطابق مع أي من هذه المثيلات.

#### <a name="deploying-and-managing-policy-via-intune"></a>نشر نهج وإدارته عبر Intune

تسمح لك ميزة تثبيت الجهاز بتطبيق النهج من خلال Intune على الجهاز.

#### <a name="licensing"></a>الترخيص

قبل البدء في تثبيت الجهاز، يجب عليك تأكيد اشتراكك Microsoft 365[.](https://www.microsoft.com/en-in/microsoft-365/compare-microsoft-365-enterprise-plans?rtc=2) للوصول إلى تثبيت الجهاز واستخدامه، يجب أن يكون لديك Microsoft 365 E3.

#### <a name="permission"></a>الإذن

لنشر النهج في Intune، يجب أن يكون للحساب أذونات لإنشاء ملفات تعريف تكوين الجهاز أو تحريرها أو تحديثها أو حذفها. يمكنك إنشاء أدوار مخصصة أو استخدام أي من الأدوار المضمنة باستخدام هذه الأذونات:

- دور إدارة ملفات التعريف والسياسات
- أو دور مخصص مع تشغيل أذونات إنشاء/تحرير/تحديث/قراءة/حذف/عرض التقارير لملفات تعريف تكوين الجهاز
- أو المسؤول العام

#### <a name="deploying-policy"></a>نهج النشر

في إدارة نقاط النهاية من Microsoft [https://endpoint.microsoft.com/](https://endpoint.microsoft.com/)

1. تكوين منع **تثبيت الأجهزة باستخدام برامج التشغيل التي تتطابق مع فئات إعداد الجهاز هذه**.

    - افتح أمان نقطة النهاية > الحد من الهجمات > إنشاء نهج > الأساسي: Windows 10 (واللاحقة) & التعريف: التحكم في الجهاز.
    
      :::image type="content" source="../../media/devicepolicy-editprofile.png" alt-text="صفحة تحرير ملف التعريف" lightbox="../../media/devicepolicy-editprofile.png":::
    
2. قم بتوصيل USB، جهاز وسترى رسالة الخطأ التالية:

      :::image type="content" source="../../media/devicepolicy-errormsg.png" alt-text="رسالة الخطأ" lightbox="../../media/devicepolicy-errormsg.png":::

3. تمكين **تطبيق ترتيب التقييم الطبقي لنهج السماح ومنع تثبيت الجهاز عبر جميع الأجهزة متطابقة مع المعايير**.

    - **دعم OMA-URI** فقط في الوقت الحالي: > ملفات تعريف تكوين > إنشاء ملف تعريف > الأساسي: Windows 10 (واللاحقة) & ملف التعريف: مخصص
    
      :::image type="content" source="../../media/devicepolicy-editrow.png" alt-text="الصفحة &quot;تحرير صف&quot;" lightbox="../../media/devicepolicy-editrow.png":::

4. تمكين "المثيل" المسموح به ل USB وإضافته – السماح بتثبيت **الأجهزة التي تتطابق مع أي من هذه** المثيلات.

    - تحديث ملف تعريف عنصر تحكم الجهاز في الخطوة 1
    
      :::image type="content" source="../../media/devicepolicy-devicecontrol.png" alt-text="معرف في صفحة &quot;التحكم في الجهاز&quot;" lightbox="../../media/devicepolicy-devicecontrol.png":::
       
    إضافة PCI\CC_0C03؛ PCI\CC_0C0330; PCI\VEN_8086; PNP0CA1; PNP0CA1&HOST; USB\ROOT_HUB30; USB\ROOT_HUB20; USB\USB20_HUB التقاط الشاشة أعلاه لأنه ليس كافيا لتمكين "معر ِّف" جهاز واحد فقط لتمكين محرك أقراص USB إبهام واحد. يجب عليك التأكد من أن جميع أجهزة USB التي تسبق الهدف غير مسموح بها أيضا. يمكنك فتح إدارة الأجهزة وتغيير طريقة العرض إلى "الأجهزة بواسطة الاتصالات" لمعرفة الطريقة التي تم بها تثبيت الأجهزة في شجرة PnP. في حالتنا، يجب السماح للأجهزة التالية حتى يمكن السماح بمحرك أقراص USB المصغر الهدف أيضا: 

    إضافة PCI\CC_0C03؛ PCI\CC_0C0330; PCI\VEN_8086; PNP0CA1; PNP0CA1&HOST; USB\ROOT_HUB30; USB\ROOT_HUB20; USB\USB20_HUB التقاط الشاشة أعلاه لأنه ليس كافيا لتمكين "معر ِّف" جهاز واحد فقط لتمكين محرك أقراص USB إبهام واحد. يجب عليك التأكد من أن جميع أجهزة USB التي تسبق الهدف غير مسموح بها أيضا. يمكنك فتح إدارة الأجهزة وتغيير طريقة العرض إلى "الأجهزة بواسطة الاتصالات" لمعرفة الطريقة التي تم بها تثبيت الأجهزة في شجرة PnP. في حالتنا، يجب السماح للأجهزة التالية حتى يمكن السماح بمحرك أقراص USB المصغر الهدف أيضا:

    - "Intel(R) وحدة تحكم مضيف USB 3.0 eXtensible – 1.0 (Microsoft)" -> PCI\CC_0C03
    - "USB Root Hub (USB 3.0))" -> USB\ROOT_HUB30
    - "Generic USB Hub" -> USB\USB20_HUB

    :::image type="content" source="../../media/devicepolicy-devicemgr.png" alt-text="عنصر القائمة &quot;عرض&quot; في إدارة الأجهزة الصفحة" lightbox="../../media/devicepolicy-devicemgr.png":::

    > [!NOTE]
    > بعض الأجهزة في النظام لديها عدة طبقات من الاتصال لتعريف تثبيتها على النظام. محركات أقراص USB المصغرة هي مثل هذه الأجهزة. وبالتالي، عند البحث عن حظرها أو السماح بها على نظام، من المهم فهم مسار الاتصال لكل جهاز. هناك عدة أجهزة عامة تستخدم عادة في الأنظمة ويمكن أن توفر بداية جيدة لإنشاء "قائمة السماح" في مثل هذه الحالات. فيما يلي مثال واحد (ليس دائما هو نفسه لجميع USBs؛ أنت بحاجة إلى فهم شجرة PnP للجهاز الذي تريد إدارته من خلال إدارة الأجهزة):
    >
    > PCI\CC_0C03; PCI\CC_0C0330; PCI\VEN_8086; PNP0CA1; PNP0CA1&HOST (for Host Controllers)/ USB\ROOT_HUB30; USB\ROOT_HUB20 (ل USB Root Hubs)/ USB\USB20_HUB (لمحورات USB العامة)/
    >
    > على وجه التحديد لأجهزة سطح المكتب، من المهم سرد جميع أجهزة USB المتصلة بها لوحات المفاتيح وأجهزة الماوس في القائمة أعلاه. قد يؤدي عدم القيام بذلك إلى منع المستخدم من الوصول إلى جهازه من خلال أجهزة HID.
    >
    > في بعض الأحيان، يكون لدى الشركات المصنعة المختلفة للكمبيوتر الشخصي طرق مختلفة لتداخل أجهزة USB في شجرة PnP، ولكن بشكل عام، هذه هي الطريقة التي يتم بها ذلك.

5. قم بتوصيل USB المسموح به مرة أخرى. ستشاهد أنه مسموح به ومتوفر الآن.

    :::image type="content" source="../../media/devicepolicy-removedrive.png" alt-text="الصفحة &quot;إزالة تفاصيل محرك الأقراص&quot;" lightbox="../../media/devicepolicy-removedrive.png":::

#### <a name="deploying-and-managing-policy-via-group-policy"></a>نشر نهج وإدارته عبر نهج المجموعة

تسمح لك ميزة تثبيت الجهاز بتطبيق النهج من خلال نهج المجموعة.

#### <a name="licensing"></a>الترخيص

للوصول إلى تثبيت الجهاز واستخدامه، يجب أن يكون لديك Windows E3.

#### <a name="deploying-policy"></a>نهج النشر

يمكنك العثور على تفاصيل النشر هنا: إدارة تثبيت الجهاز [باستخدام نهج المجموعة (Windows 10) - Windows العميل](/windows/client-management/manage-device-installation-with-group-policy).

## <a name="view-device-control-removable-storage-access-control-data-in-microsoft-defender-for-endpoint"></a>عرض بيانات التحكم في الوصول إلى مساحة التخزين القابلة للإزالة في Microsoft Defender لنقطة النهاية

يعرض [Microsoft 365 أمان](https://sip.security.microsoft.com/homepage) الجهاز مساحة تخزين قابلة للإزالة تم حظرها بواسطة تثبيت جهاز التحكم في الجهاز. للوصول إلى Microsoft 365 الأمان، يجب أن يكون لديك الاشتراك التالي:

- Microsoft 365 لتقارير E5

```kusto
//events triggered by Device Installation policies
DeviceEvents
| where ActionType == "PnpDeviceBlocked" or ActionType == "PnpDeviceAllowed"
| extend parsed=parse_json(AdditionalFields)
| extend MediaClassGuid = tostring(parsed.ClassGuid)
| extend MediaInstanceId = tostring(parsed.DeviceInstanceId)
| extend MediaDeviceId = tostring(parsed.MatchingDeviceId)
| project Timestamp , DeviceId, DeviceName, ActionType, MediaClassGuid, MediaDeviceId, MediaInstanceId, AdditionalFields
| order by Timestamp desc
```

:::image type="content" source="../../media/block-removable-storage2.png" alt-text="مساحة التخزين &quot;حظر&quot;" lightbox="../../media/block-removable-storage2.png":::

## <a name="frequently-asked-questions"></a>الأسئلة المتكررة

### <a name="how-can-i-know-whether-the-target-machine-gets-the-deployed-policy"></a>كيف يمكنني معرفة ما إذا كان الجهاز الهدف يحصل على النهج الذي تم نشره؟

يمكنك استخدام الاستعلام التالي للحصول على إصدار عميل مكافحة البرامج الضارة على Microsoft 365 الأمان:

```kusto
//check whether the Device installation policy has been deployed to the target machine, event only when modification happens
DeviceRegistryEvents
| where RegistryKey contains "HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows\\DeviceInstall\\"
| order by Timestamp desc
```

## <a name="why-the-allow-policy-doesnt-work"></a>لماذا لا يعمل نهج السماح؟

لا يكفي تمكين "معرِّف جهاز واحد" فقط لتمكين محرك أقراص USB إبهام واحد. تأكد من أن جميع أجهزة USB التي تسبق الهدف لا يتم حظرها (مسموح بها) أيضا.

:::image type="content" source="../../media/devicemgrscrnshot.png" alt-text="الأسئلة الشائعة حول تثبيت الجهاز" lightbox="../../media/devicemgrscrnshot.png":::

