---
title: إنشاء قواعد الكشف المخصصة وإدارتها في Microsoft 365 Defender
description: تعرف على كيفية إنشاء قواعد الكشف المخصصة وإدارتها استنادا إلى استعلامات الصيد المتقدمة
keywords: عمليات البحث المتقدمة، وصيد التهديدات، والصيد عبر الإنترنت، Microsoft 365 Defender، و microsoft 365، و m365، والبحث، والاستعلام، والتعقب، والكشف المخصص، والقواعد، والم مخطط، و kusto، وRBAC، والأذونات، و Microsoft Defender ل Endpoint
search.product: eADQiWindows 10XVcnh
search.appverid: met150
ms.prod: m365-security
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
f1.keywords:
- NOCSH
ms.author: maccruz
author: schmurky
ms.localizationpriority: medium
manager: dansimp
audience: ITPro
ms.collection:
- M365-security-compliance
- m365initiative-m365-defender
ms.topic: article
ms.technology: m365d
ms.openlocfilehash: dac2a68249d90b212e6bbcaacdec84918560deb5
ms.sourcegitcommit: d32654bdfaf08de45715dd362a7d42199bdc1ee7
ms.translationtype: MT
ms.contentlocale: ar-SA
ms.lasthandoff: 03/23/2022
ms.locfileid: "63755819"
---
# <a name="create-and-manage-custom-detections-rules"></a>إنشاء قواعد عمليات الكشف المخصصة وإدارتها

[!INCLUDE [Microsoft 365 Defender rebranding](../includes/microsoft-defender.md)]


**ينطبق على:**
- Microsoft 365 Defender
- Microsoft Defender لنقطة النهاية

قواعد الكشف المخصصة هي القواعد التي يمكنك تصميمها وتعديلها باستخدام [استعلامات](advanced-hunting-overview.md) البحث المتقدمة. تسمح لك هذه القواعد بمراقبة الأحداث المختلفة وقواعد النظام بشكل استباقي، بما في ذلك نشاط الانتهاك المشتبه به ونقاط النهاية التي تم تكوينها بشكل خاطئ. يمكنك تعيينها للتشغيل في فواصل زمنية منتظمة، مع إنشاء التنبيهات، كما يمكنك اتخاذ إجراءات الاستجابة عند وجود تطابقات.

## <a name="required-permissions-for-managing-custom-detections"></a>الأذونات المطلوبة لإدارة الكشف المخصص

لإدارة عمليات الكشف المخصصة، يجب أن يتم تعيين أحد هذه الأدوار:

- **مسؤول الأمان** —يمكن للمستخدمين الذين لديهم دور [Azure Active Directory](/azure/active-directory/roles/permissions-reference#security-administrator) هذا إدارة إعدادات الأمان في مدخل Microsoft 365 Defender والمداخل والخدمات الأخرى.

- **عامل تشغيل الأمان** — يمكن للمستخدمين الذين لديهم دور [Azure Active Directory](/azure/active-directory/roles/permissions-reference#security-operator) هذا إدارة التنبيهات والحصول على حق الوصول للقراءة فقط العام إلى الميزات ذات الصلة ب الأمان، بما في ذلك كل المعلومات في مدخل Microsoft 365 Defender. يكفي هذا الدور لإدارة الاكتشافات المخصصة فقط إذا تم إيقاف تشغيل التحكم بالوصول المستند إلى الدور (RBAC) في Microsoft Defender لنقطة النهاية. إذا قمت بتكوين RBAC، تحتاج أيضا إلى إذن إدارة  إعدادات الأمان ل Defender لنقطة النهاية.

يمكنك أيضا إدارة عمليات الكشف المخصصة التي تنطبق على البيانات من Microsoft 365 Defender محددة إذا كانت لديك أذونات لها. إذا كان لديك فقط أذونات إدارة Microsoft 365 Defender Office، على سبيل المثال، يمكنك إنشاء عمليات الكشف المخصصة باستخدام `Email` الجداول وليس الجداول`Identity`.  

لإدارة الأذونات المطلوبة، يمكن للمسؤول **العام** :

- قم بتعيين **دور مسؤول الأمان** أو عامل **الأمان** [في مركز مسؤولي Microsoft 365](https://admin.microsoft.com/) **مسؤول RolesSecurity** > .
- تحقق من إعدادات RBAC ل Microsoft Defender لنقطة [النهاية في](https://security.microsoft.com/) Microsoft 365 Defender ضمن **الإعدادات** >  **PermissionsRoles** > . حدد الدور المقابل لتعيين **إذن إدارة إعدادات الأمان** .

> [!NOTE]
> لإدارة عمليات الكشف المخصصة، ستحتاج  عوامل تشغيل الأمان إلى إذن  إدارة إعدادات الأمان في Microsoft Defender لنقطة النهاية في حالة تشغيل RBAC.

## <a name="create-a-custom-detection-rule"></a>إنشاء قاعدة اكتشاف مخصصة
### <a name="1-prepare-the-query"></a>1. إعداد الاستعلام.

في Microsoft 365 Defender، انتقل إلى **البحث** المتقدم وحدد استعلاما موجودا أو أنشئ استعلاما جديدا. عند استخدام استعلام جديد، قم بتشغيل الاستعلام لتحديد الأخطاء وفهم النتائج المحتملة.

>[!IMPORTANT]
>لمنع الخدمة من إرجاع عدد كبير جدا من التنبيهات، تقتصر كل قاعدة على إنشاء 100 تنبيه فقط كلما تم تشغيلها. قبل إنشاء قاعدة، يمكنك تعديل الاستعلام لتجنب التنبيه إلى النشاط العادي يوميا.


#### <a name="required-columns-in-the-query-results"></a>الأعمدة المطلوبة في نتائج الاستعلام
لإنشاء قاعدة كشف مخصصة، يجب أن يرجع الاستعلام الأعمدة التالية:

- `Timestamp`—يستخدم لتعيين الوقت للتنبيهات التي تم إنشاؤها
- `ReportId`— لتمكين البحث عن السجلات الأصلية
- أحد الأعمدة التالية التي تحدد أجهزة أو مستخدمين أو علب بريد معينة:
    - `DeviceId`
    - `DeviceName`
    - `RemoteDeviceName`
    - `RecipientEmailAddress`
    - `SenderFromAddress` (مرسل المغلف أو عنوان Return-Path)
    - `SenderMailFromAddress` (عنوان المرسل المعروض بواسطة عميل البريد الإلكتروني)
    - `RecipientObjectId`
    - `AccountObjectId`
    - `AccountSid`
    - `AccountUpn`
    - `InitiatingProcessAccountSid`
    - `InitiatingProcessAccountUpn`
    - `InitiatingProcessAccountObjectId`

>[!NOTE]
>سيضاف الدعم للكيانات الإضافية مع إضافة جداول جديدة إلى [مخطط الصيد المتقدم](advanced-hunting-schema-tables.md).

عادة ما تقوم الاستعلامات `project` البسيطة، مثل تلك التي لا تستخدم عامل التشغيل أو `summarize` لتخصيص النتائج أو تجميعها، بإرجاع هذه الأعمدة الشائعة.

هناك طرق مختلفة لضمان إرجاع هذه الأعمدة للاستعلامات الأكثر تعقيدا. على سبيل المثال `DeviceId`، إذا كنت تفضل التجميع والتعدي حسب الكيان ضمن عمود مثل ، `Timestamp` `ReportId` لا يزال بإمكانك إرجاعه والحصول عليه من الحدث الأخير الذي يتضمن كل حدث فريد `DeviceId`.


> [!IMPORTANT]
> تجنب تصفية الاكتشافات المخصصة باستخدام `Timestamp` العمود. تمت تصفية البيانات المستخدمة للكشفات المخصصة مسبقا استنادا إلى تكرار الكشف.


يحتسب الاستعلام النموذجي أدناه عدد الأجهزة الفريدة (`DeviceId`) التي تستخدم عمليات الكشف عن الفيروسات ويستخدم هذا العدد للعثور على الأجهزة التي بها أكثر من خمسة عمليات كشف فقط. لإرجاع الأحدث وما `Timestamp` يطابقه `ReportId`، يستخدم `summarize` عامل التشغيل مع الدالة `arg_max` .

```kusto
DeviceEvents
| where ingestion_time() > ago(1d)
| where ActionType == "AntivirusDetection"
| summarize (Timestamp, ReportId)=arg_max(Timestamp, ReportId), count() by DeviceId
| where count_ > 5
```

> [!TIP]
> للحصول على أداء أفضل للاستعلام، قم بتعيين عامل تصفية الوقت الذي يتطابق مع تكرار التشغيل المقصود للقاعدة. بما أن أقل تشغيل متكرر هو _كل 24 ساعة_، فإن التصفية لليوم الماضي ستغطي كل البيانات الجديدة.

### <a name="2-create-new-rule-and-provide-alert-details"></a>2. إنشاء قاعدة جديدة وتوفير تفاصيل التنبيه.

باستخدام الاستعلام في محرر الاستعلام، حدد **إنشاء قاعدة الكشف** وحدد تفاصيل التنبيه التالية:

- **اسم الكشف**- اسم قاعدة الكشف؛ يجب أن يكون فريدا
- **Frequency** — فاصل زمني لتشغيل الاستعلام لاتخاذ إجراء. [الاطلاع على إرشادات إضافية أدناه](#rule-frequency)
- **عنوان التنبيه**— عنوان معروض مع التنبيهات التي يتم تشغيلها بواسطة القاعدة؛ يجب أن يكون فريدا
- **الخطورة**— الخطر المحتمل للمكون أو النشاط الذي تحدده القاعدة
- **الفئة** —مكون التهديد أو النشاط المعرف بواسطة القاعدة
- **تستخدم تقنية MITRE ATT&CK**— وهي تقنية هجوم واحدة أو أكثر تم تعريفها بواسطة القاعدة كما هو موثق في [إطار عمل MITRE ATT&CK](https://attack.mitre.org/). تم إخفاء هذا القسم لفئات تنبيه معينة، بما في ذلك البرامج الضارة وبرامج الفدية الضارة والنشاط المريب والبرامج غير المرغوب فيها
- **الوصف**—مزيد من المعلومات حول المكون أو النشاط الذي حددته القاعدة 
- **الإجراءات الموصى** بها— إجراءات إضافية قد يتخذها المجيبون استجابة لتنبيه

#### <a name="rule-frequency"></a>تكرار القاعدة
عند حفظ قاعدة جديدة، يتم تشغيلها وتتحقق من تطابقات البيانات التي تم جمعها خلال الثلاثين يوما الماضية. بعد ذلك، يتم تشغيل القاعدة مرة أخرى عند فواصل زمنية ثابتة، مع تطبيق مدة البحث استنادا إلى التكرار الذي تختاره:

- **كل 24 ساعة—** يتم تشغيله كل 24 ساعة، مع التحقق من البيانات من ال 30 يوما الماضية
- **كل 12 ساعة—** يتم تشغيله كل 12 ساعة، مع التحقق من البيانات من ال 24 ساعة الماضية
- **كل 3 ساعات—** يتم تشغيله كل 3 ساعات، مع التحقق من البيانات من الساعات الستة الماضية
- **كل ساعة**— يتم تشغيلها كل ساعة، والتحقق من البيانات من الساعتين الماضيتين

عند تحرير قاعدة، سيتم تشغيلها مع التغييرات المطبقة في وقت التشغيل التالي المجدول وفقا لمدى التكرار الذي قمت بتعيينه.



>[!TIP]
> يمكنك مطابقة عوامل تصفية الوقت في الاستعلام مع مدة البحث. يتم تجاهل النتائج خارج مدة البحث.  

حدد التكرار الذي يتطابق مع مدى قربك من مراقبة الاكتشافات. فكر في قدرة مؤسستك على الاستجابة للتنبيهات.

### <a name="3-choose-the-impacted-entities"></a>3. اختر الكيانات التي تم التأثير عليها.
حدد الأعمدة في نتائج الاستعلام حيث تتوقع العثور على الكيان الرئيسي المتأثر أو المتأثر. على سبيل المثال، قد يرجع الاستعلام عناوين المرسل (`SenderFromAddress` أو `SenderMailFromAddress`) والمستلم (`RecipientEmailAddress`). يساعد تحديد أي من هذه الأعمدة يمثل الكيان الرئيسي الذي تم التأثير عليه الخدمة على تجميع التنبيهات ذات الصلة وربط الأحداث والإجراءات المستهدفة للاستجابة.

يمكنك تحديد عمود واحد فقط لكل نوع كيان (علبة البريد أو المستخدم أو الجهاز). لا يمكن تحديد الأعمدة التي لم يتم إرجاعها بواسطة الاستعلام.

### <a name="4-specify-actions"></a>4. تحديد الإجراءات.
يمكن لقاعدة الكشف المخصصة أن تتخذ تلقائيا إجراءات على الأجهزة أو الملفات أو المستخدمين الذين يتم إرجاعهم بواسطة الاستعلام.

#### <a name="actions-on-devices"></a>الإجراءات على الأجهزة
يتم تطبيق هذه الإجراءات على الأجهزة في عمود `DeviceId` نتائج الاستعلام:
- **عزل الجهاز**— يستخدم Microsoft Defender ل Endpoint لتطبيق عزل الشبكة بالكامل، مما يمنع الجهاز من الاتصال بأي تطبيق أو خدمة. [تعرف على المزيد حول عزل جهاز Microsoft Defender لنقطة النهاية](/windows/security/threat-protection/microsoft-defender-atp/respond-machine-alerts#isolate-devices-from-the-network)
- **تجميع حزمة التحقيق** — تجمع معلومات الجهاز في ملف ZIP. [تعرف على المزيد حول حزمة التحقيق في Microsoft Defender for Endpoint](/windows/security/threat-protection/microsoft-defender-atp/respond-machine-alerts#collect-investigation-package-from-devices)
- **تشغيل مسح الحماية** من الفيروسات — إجراء فحص برنامج الحماية من الفيروسات لـ Windows Defender كامل على الجهاز
- **بدء التحقيق** — بدء [تحقيق تلقائي](m365d-autoir.md) على الجهاز
- **تقييد تنفيذ التطبيق** — تعيين قيود على الجهاز للسماح بتشغيل الملفات التي تم توقيعها باستخدام شهادة صادرة عن Microsoft فقط. [تعرف على المزيد حول قيود التطبيق باستخدام Microsoft Defender لنقطة النهاية](/microsoft-365/security/defender-endpoint/respond-machine-alerts#restrict-app-execution)

#### <a name="actions-on-files"></a>الإجراءات على الملفات
عند تحديد هذا الإجراء، يمكنك اختيار تطبيق إجراء الملف **"**`SHA1`الفحص" على الملفات الموجودة في ، أو `InitiatingProcessSHA1`، `SHA256``InitiatingProcessSHA256` أو العمود الخاص بنتائج الاستعلام. يحذف هذا الإجراء الملف من موقعه الحالي ويضع نسخة في الفحص.

#### <a name="actions-on-users"></a>الإجراءات على المستخدمين
عند تحديد هذا الإجراء،  `AccountObjectId`يتم اتخاذ الإجراء وضع علامة على المستخدم كمختر على المستخدمين في ، أو `InitiatingProcessAccountObjectId``RecipientObjectId` العمود الخاص بنتائج الاستعلام. يقوم هذا الإجراء بتعيين مستوى المخاطر للمستخدمين إلى "عال" في Azure Active Directory، مما يؤدي إلى تشغيل سياسات [حماية الهوية المطابقة](/azure/active-directory/identity-protection/overview-identity-protection).

> [!NOTE]
> الإجراء "السماح" أو الحظر لقواعد الكشف المخصص غير معتمد حاليا على Microsoft 365 Defender.

### <a name="5-set-the-rule-scope"></a>5. تعيين نطاق القاعدة.
قم بتعيين النطاق لتحديد الأجهزة التي تغطيها القاعدة. يؤثر النطاق على القواعد التي تحقق من الأجهزة ولا يؤثر على القواعد التي تحقق علب البريد وحسابات المستخدمين أو هوياتهم فقط.

عند تعيين النطاق، يمكنك تحديد:

- جميع الأجهزة
- مجموعات أجهزة معينة

سيتم الاستعلام عن البيانات من الأجهزة الموجودة في النطاق فقط. سيتم أيضا اتخاذ الإجراءات على هذه الأجهزة فقط.

### <a name="6-review-and-turn-on-the-rule"></a>6. مراجعة القاعدة ثم تشغيلها.
بعد مراجعة القاعدة، حدد **إنشاء** لحفظها. يتم تشغيل قاعدة الكشف المخصصة على الفور. يتم تشغيله مرة أخرى استنادا إلى التكرار الذي تم تكوينه للتحقق من تطابقات، وإنشاء تنبيهات، واتخاذ إجراءات الاستجابة.


>[!Important] 
>يجب مراجعة عمليات الكشف المخصصة بشكل منتظم للكفاءة والفعالية. للتأكد من أنك تقوم بإنشاء عمليات الكشف التي تقوم بتشغيل التنبيهات الحقيقية، خذ بعض الوقت لمراجعة عمليات الكشف المخصصة الموجودة باتباع الخطوات الموجودة في [إدارة قواعد الكشف المخصصة الموجودة](#manage-existing-custom-detection-rules). <br>  
يمكنك الاحتفاظ بالتحكم في شمولية أو خصوصية الاكتشافات المخصصة بحيث قد تشير أي تنبيهات خاطئة يتم إنشاؤها بواسطة الكشف المخصص إلى الحاجة إلى تعديل معلمات معينة للقواعد.


## <a name="manage-existing-custom-detection-rules"></a>إدارة قواعد الكشف المخصصة الموجودة
يمكنك عرض قائمة قواعد الكشف المخصصة الموجودة والتحقق من التشغيلات السابقة ومراجعة التنبيهات التي تم تشغيلها. يمكنك أيضا تشغيل قاعدة عند الطلب وتعديلها.

>[!TIP]
> تتوفر التنبيهات التي تم رفعها بواسطة الاكتشافات المخصصة عبر التنبيهات و واجهات برمجة التطبيقات للحوادث. لمزيد من المعلومات، راجع [واجهات Microsoft 365 Defender برمجة التطبيقات المعتمدة](api-supported.md).

### <a name="view-existing-rules"></a>عرض القواعد الموجودة

لعرض كل قواعد الكشف المخصصة الموجودة، انتقل إلى قواعد الكشف **عن** **CustomCustom** > . تسرد الصفحة كل القواعد التي تحتوي على معلومات التشغيل التالية:

- **آخر تشغيل**— عند آخر مرة تم فيها تشغيل قاعدة للتحقق من تطابقات الاستعلامات وإنشاء تنبيهات
- **حالة التشغيل الأخير**— ما إذا كانت القاعدة قد تم تشغيلها بنجاح
- **التشغيل التالي**— التشغيل المجدول التالي
- **الحالة** — سواء تم تشغيل قاعدة أو إيقاف تشغيلها

### <a name="view-rule-details-modify-rule-and-run-rule"></a>عرض تفاصيل القاعدة وتعديل القاعدة وتشغيل القاعدة

لعرض معلومات شاملة حول قاعدة الكشف المخصصة، انتقل إلى قواعد الكشف **عن** **CustomCustom** >  ثم حدد اسم القاعدة. يمكنك بعد ذلك عرض معلومات عامة حول القاعدة، بما في ذلك معلومات حول حالة تشغيلها ونطاقها. توفر الصفحة أيضا قائمة بالتنبيهات والإجراءات التي تم تشغيلها.

:::image type="content" source="../../media/custom-detect-rules-view.png" alt-text="صفحة تفاصيل قاعدة الكشف المخصص في مدخل Microsoft 365 Defender" lightbox="../../media/custom-detect-rules-view.png":::<br>
*تفاصيل قاعدة الكشف المخصصة*

يمكنك أيضا اتخاذ الإجراءات التالية على القاعدة من هذه الصفحة:

- **تشغيل**—تشغيل القاعدة على الفور. كما يعيد ذلك تعيين الفاصل الزمني للتشغيل التالي.
- **تحرير**—تعديل القاعدة دون تغيير الاستعلام
- **تعديل الاستعلام** — تحرير الاستعلام في البحث المتقدم
-  /  تشغيل **إيقاف تشغيل** —تمكين القاعدة أو إيقاف تشغيلها
- **حذف**—إيقاف تشغيل القاعدة وإزالتها

### <a name="view-and-manage-triggered-alerts"></a>عرض التنبيهات المشغلة وإدارتها

في شاشة تفاصيل القاعدة (نتائج الكشف **عنCustom** >  > **[اسم القاعدة]**)، انتقل إلى التنبيهات المشغلة، التي تسرد التنبيهات التي تم إنشاؤها بواسطة التطابقات مع القاعدة. حدد تنبيها لعرض معلومات مفصلة حوله واتخذ الإجراءات التالية:

- إدارة التنبيه من خلال تعيين الحالة والتصنيف (تنبيه صحيح أو خاطئ)
- ربط التنبيه بحادث
- تشغيل الاستعلام الذي يقوم بتشغيل التنبيه على عمليات البحث المتقدمة

### <a name="review-actions"></a>مراجعة الإجراءات
في شاشة تفاصيل القاعدة (نتائج الكشف **عنCustom** >  > **[اسم القاعدة]**)، انتقل إلى الإجراءات المشغلة، التي تسرد الإجراءات التي تم اتخاذها بالاستناد إلى تطابقات مع القاعدة.

>[!TIP]
>لعرض المعلومات بسرعة واتخاذ إجراء على عنصر في جدول، استخدم عمود التحديد [&#10003;] في الجانب الأيمن من الجدول.

>[!NOTE]
>قد لا تتوفر بعض الأعمدة في هذه المقالة في Microsoft Defender لنقطة النهاية. [قم Microsoft 365 Defender](m365d-enable.md) للبحث عن التهديدات باستخدام المزيد من مصادر البيانات. يمكنك نقل مهام سير عمل الصيد المتقدمة من Microsoft Defender ل Endpoint إلى Microsoft 365 Defender باتباع الخطوات الواردة في ترحيل استعلامات الصيد المتقدمة من [Microsoft Defender ل Endpoint](advanced-hunting-migrate-from-mde.md).

## <a name="see-also"></a>راجع أيضًا
- [نظرة عامة على الكشف المخصص](custom-detections-overview.md)
- [نظرة عامة متقدمة حول الصيد](advanced-hunting-overview.md)
- [تعرف على لغة استعلام الصيد المتقدمة](advanced-hunting-query-language.md)
- [ترحيل استعلامات البحث المتقدمة من Microsoft Defender ل Endpoint](advanced-hunting-migrate-from-mde.md)
